{
  "0": 0,
  "1": -1,
  "10": 8,
  "100": 45,
  "1000": -1,
  "1001": -1,
  "1002": -1,
  "1003": -1,
  "1004": -1,
  "1005": -1,
  "1006": -1,
  "1007": -1,
  "1008": -1,
  "1009": -1,
  "101": -1,
  "1010": -1,
  "1011": -1,
  "1012": -1,
  "1013": -1,
  "1014": -1,
  "1015": -1,
  "1016": -1,
  "1017": -1,
  "1018": 477,
  "1019": 478,
  "102": -1,
  "1020": 479,
  "1021": 480,
  "1022": 481,
  "1023": 482,
  "1024": 483,
  "1025": -1,
  "1026": 484,
  "1027": 485,
  "1028": 486,
  "1029": -1,
  "103": 46,
  "1030": -1,
  "1031": -1,
  "1032": -1,
  "1033": -1,
  "1034": -1,
  "1035": -1,
  "1036": -1,
  "1037": -1,
  "1038": 487,
  "1039": 488,
  "104": -1,
  "1040": -1,
  "1041": 489,
  "1042": 490,
  "1043": 491,
  "1044": 492,
  "1045": 493,
  "1046": 494,
  "1047": -1,
  "1048": -1,
  "1049": -1,
  "105": -1,
  "1050": -1,
  "1051": -1,
  "1052": -1,
  "1053": -1,
  "1054": -1,
  "1055": -1,
  "1056": -1,
  "1057": -1,
  "1058": -1,
  "1059": -1,
  "106": -1,
  "1060": -1,
  "1061": -1,
  "1062": -1,
  "1063": -1,
  "1064": -1,
  "1065": -1,
  "1066": -1,
  "1067": -1,
  "1068": 495,
  "1069": -1,
  "107": 47,
  "1070": 496,
  "1071": 497,
  "1072": -1,
  "1073": 498,
  "1074": 499,
  "1075": -1,
  "1076": 500,
  "1077": -1,
  "1078": 501,
  "1079": 502,
  "108": -1,
  "1080": 503,
  "1081": 504,
  "1082": -1,
  "1083": 505,
  "1084": 506,
  "1085": -1,
  "1086": -1,
  "1087": -1,
  "1088": -1,
  "1089": 507,
  "109": -1,
  "1090": -1,
  "1091": -1,
  "1092": 508,
  "1093": -1,
  "1094": -1,
  "1095": 509,
  "1096": -1,
  "1097": -1,
  "1098": 510,
  "1099": 511,
  "11": -1,
  "110": -1,
  "1100": -1,
  "1101": 512,
  "1102": -1,
  "1103": -1,
  "111": -1,
  "112": 48,
  "113": -1,
  "114": 49,
  "115": 50,
  "116": 51,
  "117": 52,
  "118": 53,
  "119": 54,
  "12": 9,
  "120": 55,
  "121": 56,
  "122": 57,
  "123": 58,
  "124": 59,
  "125": 60,
  "126": -1,
  "127": 61,
  "128": -1,
  "129": -1,
  "13": 10,
  "130": 62,
  "131": -1,
  "132": -1,
  "133": -1,
  "134": 63,
  "135": 64,
  "136": -1,
  "137": 65,
  "138": -1,
  "139": 66,
  "14": -1,
  "140": -1,
  "141": 67,
  "142": 68,
  "143": 69,
  "144": 70,
  "145": 71,
  "146": 72,
  "147": 73,
  "148": 74,
  "149": 75,
  "15": -1,
  "150": 76,
  "151": -1,
  "152": 77,
  "153": -1,
  "154": 78,
  "155": 79,
  "156": -1,
  "157": -1,
  "158": 80,
  "159": 81,
  "16": -1,
  "160": 82,
  "161": 83,
  "162": 84,
  "163": 85,
  "164": -1,
  "165": -1,
  "166": -1,
  "167": -1,
  "168": -1,
  "169": -1,
  "17": 11,
  "170": 86,
  "171": 87,
  "172": -1,
  "173": -1,
  "174": -1,
  "175": -1,
  "176": -1,
  "177": -1,
  "178": -1,
  "179": -1,
  "18": -1,
  "180": -1,
  "181": -1,
  "182": 88,
  "183": -1,
  "184": -1,
  "185": -1,
  "186": 89,
  "187": -1,
  "188": 90,
  "189": -1,
  "19": 12,
  "190": -1,
  "191": -1,
  "192": 91,
  "193": 92,
  "194": 93,
  "195": 94,
  "196": -1,
  "197": -1,
  "198": 95,
  "199": -1,
  "2": 1,
  "20": 13,
  "200": 96,
  "201": 97,
  "202": 98,
  "203": 99,
  "204": 100,
  "205": 101,
  "206": 102,
  "207": 103,
  "208": 104,
  "209": 105,
  "21": 14,
  "210": 106,
  "211": 107,
  "212": 108,
  "213": -1,
  "214": 109,
  "215": 110,
  "216": -1,
  "217": 111,
  "218": -1,
  "219": -1,
  "22": -1,
  "220": -1,
  "221": 112,
  "222": -1,
  "223": 113,
  "224": 114,
  "225": 115,
  "226": -1,
  "227": 116,
  "228": 117,
  "229": -1,
  "23": 15,
  "230": 118,
  "231": -1,
  "232": -1,
  "233": -1,
  "234": -1,
  "235": -1,
  "236": -1,
  "237": -1,
  "238": -1,
  "239": -1,
  "24": -1,
  "240": -1,
  "241": -1,
  "242": -1,
  "243": -1,
  "244": -1,
  "245": -1,
  "246": -1,
  "247": -1,
  "248": -1,
  "249": -1,
  "25": -1,
  "250": -1,
  "251": -1,
  "252": -1,
  "253": -1,
  "254": -1,
  "255": -1,
  "256": -1,
  "257": -1,
  "258": 119,
  "259": -1,
  "26": -1,
  "260": -1,
  "261": 120,
  "262": -1,
  "263": -1,
  "264": 121,
  "265": -1,
  "266": -1,
  "267": 122,
  "268": -1,
  "269": -1,
  "27": -1,
  "270": -1,
  "271": 123,
  "272": -1,
  "273": 124,
  "274": 125,
  "275": 126,
  "276": -1,
  "277": 127,
  "278": 128,
  "279": 129,
  "28": 16,
  "280": -1,
  "281": 130,
  "282": 131,
  "283": 132,
  "284": -1,
  "285": 133,
  "286": -1,
  "287": 134,
  "288": 135,
  "289": 136,
  "29": 17,
  "290": -1,
  "291": -1,
  "292": -1,
  "293": -1,
  "294": -1,
  "295": -1,
  "296": -1,
  "297": -1,
  "298": -1,
  "299": -1,
  "3": 2,
  "30": 18,
  "300": -1,
  "301": -1,
  "302": -1,
  "303": -1,
  "304": -1,
  "305": 137,
  "306": -1,
  "307": -1,
  "308": -1,
  "309": -1,
  "31": 19,
  "310": -1,
  "311": -1,
  "312": -1,
  "313": -1,
  "314": -1,
  "315": -1,
  "316": -1,
  "317": -1,
  "318": 138,
  "319": 139,
  "32": 20,
  "320": 140,
  "321": 141,
  "322": 142,
  "323": 143,
  "324": 144,
  "325": 145,
  "326": 146,
  "327": 147,
  "328": 148,
  "329": 149,
  "33": 21,
  "330": 150,
  "331": 151,
  "332": 152,
  "333": 153,
  "334": 154,
  "335": 155,
  "336": -1,
  "337": 156,
  "338": 157,
  "339": 158,
  "34": -1,
  "340": 159,
  "341": 160,
  "342": 161,
  "343": 162,
  "344": 163,
  "345": 164,
  "346": -1,
  "347": -1,
  "348": 165,
  "349": -1,
  "35": -1,
  "350": 166,
  "351": -1,
  "352": -1,
  "353": 167,
  "354": -1,
  "355": -1,
  "356": -1,
  "357": -1,
  "358": 168,
  "359": -1,
  "36": -1,
  "360": -1,
  "361": -1,
  "362": -1,
  "363": 169,
  "364": 170,
  "365": -1,
  "366": -1,
  "367": -1,
  "368": -1,
  "369": -1,
  "37": -1,
  "370": -1,
  "371": -1,
  "372": -1,
  "373": -1,
  "374": 171,
  "375": 172,
  "376": 173,
  "377": 174,
  "378": 175,
  "379": 176,
  "38": -1,
  "380": 177,
  "381": 178,
  "382": 179,
  "383": 180,
  "384": 181,
  "385": 182,
  "386": -1,
  "387": -1,
  "388": 183,
  "389": 184,
  "39": -1,
  "390": 185,
  "391": 186,
  "392": 187,
  "393": 188,
  "394": 189,
  "395": 190,
  "396": 191,
  "397": -1,
  "398": 192,
  "399": 193,
  "4": 3,
  "40": -1,
  "400": 194,
  "401": 195,
  "402": -1,
  "403": 196,
  "404": -1,
  "405": -1,
  "406": 197,
  "407": -1,
  "408": -1,
  "409": -1,
  "41": -1,
  "410": -1,
  "411": -1,
  "412": -1,
  "413": 198,
  "414": -1,
  "415": 199,
  "416": -1,
  "417": 200,
  "418": -1,
  "419": -1,
  "42": -1,
  "420": 201,
  "421": -1,
  "422": -1,
  "423": -1,
  "424": -1,
  "425": -1,
  "426": -1,
  "427": -1,
  "428": -1,
  "429": 202,
  "43": -1,
  "430": 203,
  "431": 204,
  "432": 205,
  "433": -1,
  "434": -1,
  "435": -1,
  "436": -1,
  "437": 206,
  "438": 207,
  "439": 208,
  "44": -1,
  "440": 209,
  "441": 210,
  "442": 211,
  "443": 212,
  "444": 213,
  "445": -1,
  "446": 214,
  "447": 215,
  "448": 216,
  "449": 217,
  "45": -1,
  "450": 218,
  "451": -1,
  "452": 219,
  "453": 220,
  "454": 221,
  "455": 222,
  "456": -1,
  "457": 223,
  "458": -1,
  "459": 224,
  "46": -1,
  "460": 225,
  "461": 226,
  "462": 227,
  "463": -1,
  "464": 228,
  "465": 229,
  "466": 230,
  "467": -1,
  "468": -1,
  "469": -1,
  "47": -1,
  "470": 231,
  "471": 232,
  "472": 233,
  "473": -1,
  "474": -1,
  "475": -1,
  "476": 234,
  "477": 235,
  "478": 236,
  "479": 237,
  "48": -1,
  "480": 238,
  "481": 239,
  "482": 240,
  "483": 241,
  "484": 242,
  "485": -1,
  "486": 243,
  "487": 244,
  "488": 245,
  "489": -1,
  "49": -1,
  "490": -1,
  "491": 246,
  "492": -1,
  "493": -1,
  "494": 247,
  "495": -1,
  "496": -1,
  "497": 248,
  "498": -1,
  "499": -1,
  "5": -1,
  "50": -1,
  "500": -1,
  "501": 249,
  "502": -1,
  "503": 250,
  "504": -1,
  "505": 251,
  "506": -1,
  "507": -1,
  "508": 252,
  "509": -1,
  "51": -1,
  "510": -1,
  "511": 253,
  "512": -1,
  "513": 254,
  "514": -1,
  "515": 255,
  "516": -1,
  "517": 256,
  "518": -1,
  "519": -1,
  "52": 22,
  "520": 257,
  "521": 258,
  "522": 259,
  "523": -1,
  "524": 260,
  "525": -1,
  "526": -1,
  "527": 261,
  "528": -1,
  "529": -1,
  "53": -1,
  "530": 262,
  "531": -1,
  "532": -1,
  "533": -1,
  "534": 263,
  "535": -1,
  "536": 264,
  "537": -1,
  "538": 265,
  "539": -1,
  "54": 23,
  "540": 266,
  "541": -1,
  "542": -1,
  "543": 267,
  "544": -1,
  "545": -1,
  "546": -1,
  "547": -1,
  "548": 268,
  "549": -1,
  "55": -1,
  "550": -1,
  "551": -1,
  "552": -1,
  "553": 269,
  "554": -1,
  "555": -1,
  "556": -1,
  "557": -1,
  "558": -1,
  "559": 270,
  "56": 24,
  "560": 271,
  "561": -1,
  "562": -1,
  "563": -1,
  "564": 272,
  "565": -1,
  "566": -1,
  "567": -1,
  "568": -1,
  "569": -1,
  "57": 25,
  "570": -1,
  "571": 273,
  "572": 274,
  "573": 275,
  "574": 276,
  "575": 277,
  "576": 278,
  "577": 279,
  "578": 280,
  "579": 281,
  "58": -1,
  "580": 282,
  "581": -1,
  "582": -1,
  "583": -1,
  "584": 283,
  "585": -1,
  "586": 284,
  "587": 285,
  "588": 286,
  "589": 287,
  "59": -1,
  "590": 288,
  "591": 289,
  "592": 290,
  "593": 291,
  "594": -1,
  "595": -1,
  "596": -1,
  "597": -1,
  "598": -1,
  "599": -1,
  "6": 4,
  "60": 26,
  "600": -1,
  "601": -1,
  "602": -1,
  "603": 292,
  "604": -1,
  "605": -1,
  "606": 293,
  "607": 294,
  "608": 295,
  "609": 296,
  "61": 27,
  "610": 297,
  "611": 298,
  "612": -1,
  "613": 299,
  "614": 300,
  "615": 301,
  "616": 302,
  "617": -1,
  "618": -1,
  "619": 303,
  "62": 28,
  "620": 304,
  "621": 305,
  "622": -1,
  "623": 306,
  "624": -1,
  "625": -1,
  "626": 307,
  "627": -1,
  "628": -1,
  "629": -1,
  "63": -1,
  "630": 308,
  "631": -1,
  "632": -1,
  "633": 309,
  "634": -1,
  "635": -1,
  "636": 310,
  "637": -1,
  "638": -1,
  "639": 311,
  "64": -1,
  "640": 312,
  "641": 313,
  "642": -1,
  "643": 314,
  "644": 315,
  "645": -1,
  "646": -1,
  "647": -1,
  "648": -1,
  "649": -1,
  "65": 29,
  "650": 316,
  "651": 317,
  "652": -1,
  "653": -1,
  "654": 318,
  "655": 319,
  "656": -1,
  "657": -1,
  "658": -1,
  "659": -1,
  "66": -1,
  "660": -1,
  "661": -1,
  "662": -1,
  "663": -1,
  "664": -1,
  "665": -1,
  "666": -1,
  "667": -1,
  "668": -1,
  "669": -1,
  "67": -1,
  "670": -1,
  "671": -1,
  "672": -1,
  "673": -1,
  "674": -1,
  "675": -1,
  "676": -1,
  "677": 320,
  "678": -1,
  "679": -1,
  "68": 30,
  "680": -1,
  "681": -1,
  "682": 321,
  "683": -1,
  "684": -1,
  "685": 322,
  "686": -1,
  "687": -1,
  "688": -1,
  "689": 323,
  "69": 31,
  "690": -1,
  "691": -1,
  "692": -1,
  "693": -1,
  "694": 324,
  "695": -1,
  "696": -1,
  "697": -1,
  "698": 325,
  "699": -1,
  "7": 5,
  "70": 32,
  "700": -1,
  "701": -1,
  "702": -1,
  "703": 326,
  "704": 327,
  "705": 328,
  "706": -1,
  "707": -1,
  "708": 329,
  "709": -1,
  "71": -1,
  "710": -1,
  "711": 330,
  "712": -1,
  "713": 331,
  "714": -1,
  "715": -1,
  "716": -1,
  "717": -1,
  "718": -1,
  "719": 332,
  "72": -1,
  "720": 333,
  "721": 334,
  "722": 335,
  "723": 336,
  "724": -1,
  "725": -1,
  "726": 337,
  "727": -1,
  "728": -1,
  "729": 338,
  "73": -1,
  "730": 339,
  "731": -1,
  "732": -1,
  "733": 340,
  "734": -1,
  "735": -1,
  "736": 341,
  "737": -1,
  "738": 342,
  "739": -1,
  "74": 33,
  "740": 343,
  "741": 344,
  "742": -1,
  "743": 345,
  "744": -1,
  "745": -1,
  "746": -1,
  "747": -1,
  "748": -1,
  "749": 346,
  "75": 34,
  "750": -1,
  "751": 347,
  "752": -1,
  "753": -1,
  "754": -1,
  "755": -1,
  "756": -1,
  "757": -1,
  "758": -1,
  "759": -1,
  "76": -1,
  "760": 348,
  "761": -1,
  "762": -1,
  "763": 349,
  "764": -1,
  "765": 350,
  "766": 351,
  "767": -1,
  "768": -1,
  "769": -1,
  "77": -1,
  "770": 352,
  "771": -1,
  "772": 353,
  "773": -1,
  "774": -1,
  "775": 354,
  "776": -1,
  "777": -1,
  "778": -1,
  "779": -1,
  "78": -1,
  "780": -1,
  "781": -1,
  "782": 355,
  "783": 356,
  "784": -1,
  "785": 357,
  "786": -1,
  "787": -1,
  "788": 358,
  "789": -1,
  "79": -1,
  "790": -1,
  "791": 359,
  "792": -1,
  "793": -1,
  "794": -1,
  "795": -1,
  "796": -1,
  "797": -1,
  "798": 360,
  "799": 361,
  "8": 6,
  "80": -1,
  "800": 362,
  "801": 363,
  "802": 364,
  "803": -1,
  "804": -1,
  "805": -1,
  "806": -1,
  "807": 365,
  "808": 366,
  "809": -1,
  "81": 35,
  "810": 367,
  "811": -1,
  "812": 368,
  "813": 369,
  "814": -1,
  "815": 370,
  "816": 371,
  "817": -1,
  "818": 372,
  "819": 373,
  "82": -1,
  "820": 374,
  "821": -1,
  "822": -1,
  "823": -1,
  "824": -1,
  "825": 375,
  "826": 376,
  "827": -1,
  "828": -1,
  "829": -1,
  "83": -1,
  "830": -1,
  "831": -1,
  "832": -1,
  "833": 377,
  "834": 378,
  "835": -1,
  "836": 379,
  "837": 380,
  "838": 381,
  "839": 382,
  "84": 36,
  "840": 383,
  "841": 384,
  "842": 385,
  "843": 386,
  "844": 387,
  "845": -1,
  "846": -1,
  "847": -1,
  "848": -1,
  "849": -1,
  "85": -1,
  "850": -1,
  "851": -1,
  "852": -1,
  "853": 388,
  "854": 389,
  "855": 390,
  "856": 391,
  "857": 392,
  "858": 393,
  "859": 394,
  "86": -1,
  "860": -1,
  "861": 395,
  "862": 396,
  "863": 397,
  "864": 398,
  "865": 399,
  "866": 400,
  "867": 401,
  "868": 402,
  "869": 403,
  "87": 37,
  "870": 404,
  "871": -1,
  "872": -1,
  "873": 405,
  "874": -1,
  "875": -1,
  "876": 406,
  "877": 407,
  "878": 408,
  "879": 409,
  "88": -1,
  "880": 410,
  "881": 411,
  "882": 412,
  "883": -1,
  "884": -1,
  "885": -1,
  "886": -1,
  "887": 413,
  "888": 414,
  "889": 415,
  "89": 38,
  "890": 416,
  "891": 417,
  "892": -1,
  "893": 418,
  "894": 419,
  "895": -1,
  "896": 420,
  "897": 421,
  "898": 422,
  "899": -1,
  "9": 7,
  "90": -1,
  "900": -1,
  "901": -1,
  "902": 423,
  "903": -1,
  "904": 424,
  "905": -1,
  "906": 425,
  "907": 426,
  "908": 427,
  "909": -1,
  "91": -1,
  "910": 428,
  "911": 429,
  "912": 430,
  "913": 431,
  "914": -1,
  "915": -1,
  "916": 432,
  "917": 433,
  "918": 434,
  "919": -1,
  "92": -1,
  "920": 435,
  "921": 436,
  "922": 437,
  "923": 438,
  "924": 439,
  "925": 440,
  "926": 441,
  "927": 442,
  "928": 443,
  "929": 444,
  "93": 39,
  "930": 445,
  "931": -1,
  "932": 446,
  "933": 447,
  "934": -1,
  "935": -1,
  "936": -1,
  "937": -1,
  "938": -1,
  "939": -1,
  "94": 40,
  "940": -1,
  "941": -1,
  "942": -1,
  "943": -1,
  "944": -1,
  "945": -1,
  "946": -1,
  "947": -1,
  "948": 448,
  "949": 449,
  "95": 41,
  "950": -1,
  "951": -1,
  "952": 450,
  "953": 451,
  "954": -1,
  "955": -1,
  "956": 452,
  "957": -1,
  "958": 453,
  "959": 454,
  "96": 42,
  "960": -1,
  "961": 455,
  "962": 456,
  "963": 457,
  "964": 458,
  "965": 459,
  "966": 460,
  "967": 461,
  "968": -1,
  "969": -1,
  "97": 43,
  "970": -1,
  "971": 462,
  "972": 463,
  "973": -1,
  "974": -1,
  "975": 464,
  "976": 465,
  "977": 466,
  "978": 467,
  "979": 468,
  "98": 44,
  "980": 469,
  "981": 470,
  "982": 471,
  "983": 472,
  "984": -1,
  "985": -1,
  "986": -1,
  "987": 473,
  "988": -1,
  "989": -1,
  "99": -1,
  "990": -1,
  "991": -1,
  "992": -1,
  "993": -1,
  "994": 474,
  "995": -1,
  "996": 475,
  "997": -1,
  "998": 476,
  "999": -1
}