{
  "0": 0,
  "1": 438,
  "2": 191,
  "3": 337,
  "4": 158,
  "5": 336,
  "6": 15,
  "7": 328,
  "8": 194,
  "9": 162,
  "10": 98,
  "11": 326,
  "12": 103,
  "13": 301,
  "14": 430,
  "15": 32,
  "16": 230,
  "17": 6,
  "18": -1,
  "19": 132,
  "20": -1,
  "21": -1,
  "22": -1,
  "23": -1,
  "24": -1,
  "25": -1,
  "26": -1,
  "27": -1,
  "28": -1,
  "29": 8,
  "30": -1,
  "31": 133,
  "32": -1,
  "33": -1,
  "34": 24,
  "35": 477,
  "36": 242,
  "37": 390,
  "38": 455,
  "39": 375,
  "40": 195,
  "41": -1,
  "42": 190,
  "43": 148,
  "44": 221,
  "45": 149,
  "46": 97,
  "47": 144,
  "48": -1,
  "49": 300,
  "50": 429,
  "51": 31,
  "52": 229,
  "53": 5,
  "54": 87,
  "55": 131,
  "56": -1,
  "57": 271,
  "58": 272,
  "59": 289,
  "60": -1,
  "61": 450,
  "62": -1,
  "63": -1,
  "64": 447,
  "65": -1,
  "66": -1,
  "67": -1,
  "68": 448,
  "69": -1,
  "70": -1,
  "71": -1,
  "72": 436,
  "73": -1,
  "74": -1,
  "75": 11,
  "76": -1,
  "77": -1,
  "78": 273,
  "79": 449,
  "80": 451,
  "81": -1,
  "82": -1,
  "83": -1,
  "84": -1,
  "85": -1,
  "86": -1,
  "87": -1,
  "88": 299,
  "89": 428,
  "90": 30,
  "91": 228,
  "92": 4,
  "93": 86,
  "94": 130,
  "95": -1,
  "96": 270,
  "97": 19,
  "98": 182,
  "99": -1,
  "100": -1,
  "101": 185,
  "102": 239,
  "103": 150,
  "104": 238,
  "105": 164,
  "106": 391,
  "107": 91,
  "108": 119,
  "109": 294,
  "110": 496,
  "111": 308,
  "112": 266,
  "113": 246,
  "114": 507,
  "115": 260,
  "116": 321,
  "117": 196,
  "118": 251,
  "119": 120,
  "120": 357,
  "121": 45,
  "122": 61,
  "123": 200,
  "124": 368,
  "125": 35,
  "126": -1,
  "127": -1,
  "128": 437,
  "129": 107,
  "130": 404,
  "131": 172,
  "132": 137,
  "133": 74,
  "134": 403,
  "135": 457,
  "136": 402,
  "137": 459,
  "138": -1,
  "139": 325,
  "140": 505,
  "141": 314,
  "142": -1,
  "143": 250,
  "144": 512,
  "145": 264,
  "146": -1,
  "147": 199,
  "148": 256,
  "149": 124,
  "150": -1,
  "151": 49,
  "152": 67,
  "153": 202,
  "154": 379,
  "155": 39,
  "156": -1,
  "157": 126,
  "158": -1,
  "159": 340,
  "160": -1,
  "161": 12,
  "162": 20,
  "163": 378,
  "164": 313,
  "165": 504,
  "166": 324,
  "167": 315,
  "168": 113,
  "169": -1,
  "170": 258,
  "171": 63,
  "172": 373,
  "173": 189,
  "174": -1,
  "175": 60,
  "176": 462,
  "177": 51,
  "178": -1,
  "179": 279,
  "180": 307,
  "181": 463,
  "182": 476,
  "183": 173,
  "184": 420,
  "185": 423,
  "186": -1,
  "187": 304,
  "188": 88,
  "189": 385,
  "190": 157,
  "191": 146,
  "192": 156,
  "193": 118,
  "194": 495,
  "195": 171,
  "196": 183,
  "197": -1,
  "198": -1,
  "199": -1,
  "200": -1,
  "201": -1,
  "202": -1,
  "203": -1,
  "204": -1,
  "205": -1,
  "206": -1,
  "207": 296,
  "208": 236,
  "209": 365,
  "210": 105,
  "211": 306,
  "212": 435,
  "213": -1,
  "214": -1,
  "215": -1,
  "216": -1,
  "217": -1,
  "218": -1,
  "219": -1,
  "220": -1,
  "221": -1,
  "222": -1,
  "223": -1,
  "224": -1,
  "225": -1,
  "226": -1,
  "227": -1,
  "228": -1,
  "229": -1,
  "230": -1,
  "231": -1,
  "232": -1,
  "233": -1,
  "234": -1,
  "235": -1,
  "236": -1,
  "237": -1,
  "238": -1,
  "239": -1,
  "240": -1,
  "241": -1,
  "242": -1,
  "243": -1,
  "244": -1,
  "245": 245,
  "246": 444,
  "247": 220,
  "248": 302,
  "249": 431,
  "250": -1,
  "251": -1,
  "252": 7,
  "253": -1,
  "254": -1,
  "255": -1,
  "256": -1,
  "257": -1,
  "258": 382,
  "259": 151,
  "260": 383,
  "261": 384,
  "262": 443,
  "263": 418,
  "264": 211,
  "265": 419,
  "266": 75,
  "267": 76,
  "268": 95,
  "269": 453,
  "270": -1,
  "271": 297,
  "272": 293,
  "273": 422,
  "274": -1,
  "275": 23,
  "276": 329,
  "277": -1,
  "278": -1,
  "279": 188,
  "280": -1,
  "281": 81,
  "282": -1,
  "283": -1,
  "284": 387,
  "285": 501,
  "286": -1,
  "287": 268,
  "288": -1,
  "289": -1,
  "290": -1,
  "291": -1,
  "292": -1,
  "293": 254,
  "294": -1,
  "295": -1,
  "296": -1,
  "297": 65,
  "298": -1,
  "299": -1,
  "300": 38,
  "301": 305,
  "302": 434,
  "303": -1,
  "304": 233,
  "305": -1,
  "306": -1,
  "307": 136,
  "308": -1,
  "309": -1,
  "310": -1,
  "311": 442,
  "312": 283,
  "313": 117,
  "314": 92,
  "315": 319,
  "316": 288,
  "317": 216,
  "318": 213,
  "319": 217,
  "320": 215,
  "321": -1,
  "322": 212,
  "323": 64,
  "324": 374,
  "325": 290,
  "326": 218,
  "327": 219,
  "328": 186,
  "329": 355,
  "330": 275,
  "331": 17,
  "332": 16,
  "333": 356,
  "334": 276,
  "335": 475,
  "336": 187,
  "337": -1,
  "338": 298,
  "339": 58,
  "340": 440,
  "341": 286,
  "342": 291,
  "343": 259,
  "344": -1,
  "345": -1,
  "346": -1,
  "347": -1,
  "348": -1,
  "349": -1,
  "350": -1,
  "351": -1,
  "352": -1,
  "353": 292,
  "354": -1,
  "355": 56,
  "356": 82,
  "357": 478,
  "358": -1,
  "359": -1,
  "360": -1,
  "361": -1,
  "362": -1,
  "363": -1,
  "364": 381,
  "365": 108,
  "366": 393,
  "367": 167,
  "368": 147,
  "369": 170,
  "370": 467,
  "371": 466,
  "372": -1,
  "373": 433,
  "374": 34,
  "375": 232,
  "376": -1,
  "377": -1,
  "378": 106,
  "379": 282,
  "380": 180,
  "381": -1,
  "382": -1,
  "383": 351,
  "384": 343,
  "385": -1,
  "386": -1,
  "387": -1,
  "388": -1,
  "389": -1,
  "390": -1,
  "391": -1,
  "392": 346,
  "393": 349,
  "394": 344,
  "395": 341,
  "396": 342,
  "397": 350,
  "398": -1,
  "399": 352,
  "400": -1,
  "401": 348,
  "402": -1,
  "403": -1,
  "404": -1,
  "405": -1,
  "406": -1,
  "407": 347,
  "408": 345,
  "409": -1,
  "410": -1,
  "411": 295,
  "412": -1,
  "413": -1,
  "414": 224,
  "415": -1,
  "416": -1,
  "417": -1,
  "418": -1,
  "419": -1,
  "420": -1,
  "421": 405,
  "422": -1,
  "423": -1,
  "424": -1,
  "425": -1,
  "426": -1,
  "427": -1,
  "428": -1,
  "429": -1,
  "430": -1,
  "431": -1,
  "432": 165,
  "433": -1,
  "434": -1,
  "435": -1,
  "436": -1,
  "437": 125,
  "438": 464,
  "439": -1,
  "440": -1,
  "441": 109,
  "442": -1,
  "443": 380,
  "444": -1,
  "445": 206,
  "446": 364,
  "447": -1,
  "448": -1,
  "449": -1,
  "450": -1,
  "451": -1,
  "452": 503,
  "453": 312,
  "454": -1,
  "455": 249,
  "456": 511,
  "457": 263,
  "458": -1,
  "459": 198,
  "460": 255,
  "461": 123,
  "462": -1,
  "463": 48,
  "464": 66,
  "465": -1,
  "466": 377,
  "467": -1,
  "468": 502,
  "469": 311,
  "470": -1,
  "471": -1,
  "472": 510,
  "473": -1,
  "474": -1,
  "475": -1,
  "476": -1,
  "477": -1,
  "478": -1,
  "479": -1,
  "480": -1,
  "481": -1,
  "482": -1,
  "483": -1,
  "484": 10,
  "485": -1,
  "486": 135,
  "487": -1,
  "488": -1,
  "489": -1,
  "490": -1,
  "491": -1,
  "492": -1,
  "493": -1,
  "494": 222,
  "495": 354,
  "496": -1,
  "497": -1,
  "498": -1,
  "499": -1,
  "500": -1,
  "501": -1,
  "502": -1,
  "503": -1,
  "504": 400,
  "505": 205,
  "506": 498,
  "507": 309,
  "508": 267,
  "509": 247,
  "510": 508,
  "511": 261,
  "512": 322,
  "513": 197,
  "514": 252,
  "515": 121,
  "516": 358,
  "517": 46,
  "518": 62,
  "519": 201,
  "520": 370,
  "521": 36,
  "522": 461,
  "523": 96,
  "524": 318,
  "525": 454,
  "526": 257,
  "527": 389,
  "528": 320,
  "529": 458,
  "530": 241,
  "531": -1,
  "532": -1,
  "533": -1,
  "534": -1,
  "535": -1,
  "536": -1,
  "537": -1,
  "538": -1,
  "539": -1,
  "540": -1,
  "541": -1,
  "542": -1,
  "543": -1,
  "544": -1,
  "545": -1,
  "546": -1,
  "547": -1,
  "548": -1,
  "549": -1,
  "550": -1,
  "551": -1,
  "552": -1,
  "553": -1,
  "554": -1,
  "555": -1,
  "556": -1,
  "557": -1,
  "558": -1,
  "559": -1,
  "560": -1,
  "561": -1,
  "562": -1,
  "563": 376,
  "564": -1,
  "565": -1,
  "566": -1,
  "567": 303,
  "568": 432,
  "569": 33,
  "570": 231,
  "571": 9,
  "572": -1,
  "573": 134,
  "574": -1,
  "575": -1,
  "576": -1,
  "577": -1,
  "578": 445,
  "579": 417,
  "580": 392,
  "581": -1,
  "582": -1,
  "583": 104,
  "584": 57,
  "585": 439,
  "586": 285,
  "587": -1,
  "588": -1,
  "589": -1,
  "590": -1,
  "591": 362,
  "592": 416,
  "593": 413,
  "594": 411,
  "595": -1,
  "596": 427,
  "597": -1,
  "598": 227,
  "599": 3,
  "600": -1,
  "601": 129,
  "602": -1,
  "603": -1,
  "604": -1,
  "605": 426,
  "606": 29,
  "607": 226,
  "608": 2,
  "609": -1,
  "610": 128,
  "611": -1,
  "612": -1,
  "613": -1,
  "614": 425,
  "615": -1,
  "616": 225,
  "617": 1,
  "618": -1,
  "619": 127,
  "620": -1,
  "621": -1,
  "622": -1,
  "623": 168,
  "624": -1,
  "625": -1,
  "626": 360,
  "627": 361,
  "628": 363,
  "629": 169,
  "630": -1,
  "631": -1,
  "632": -1,
  "633": -1,
  "634": 163,
  "635": -1,
  "636": -1,
  "637": -1,
  "638": -1,
  "639": 269,
  "640": -1,
  "641": -1,
  "642": 50,
  "643": -1,
  "644": -1,
  "645": -1,
  "646": -1,
  "647": -1,
  "648": -1,
  "649": -1,
  "650": -1,
  "651": -1,
  "652": -1,
  "653": -1,
  "654": -1,
  "655": -1,
  "656": -1,
  "657": -1,
  "658": -1,
  "659": -1,
  "660": -1,
  "661": -1,
  "662": 500,
  "663": 310,
  "664": -1,
  "665": 248,
  "666": 509,
  "667": 262,
  "668": -1,
  "669": -1,
  "670": 253,
  "671": 122,
  "672": 359,
  "673": -1,
  "674": -1,
  "675": -1,
  "676": 372,
  "677": 37,
  "678": 499,
  "679": -1,
  "680": -1,
  "681": -1,
  "682": -1,
  "683": -1,
  "684": -1,
  "685": -1,
  "686": -1,
  "687": -1,
  "688": -1,
  "689": -1,
  "690": -1,
  "691": -1,
  "692": 371,
  "693": -1,
  "694": -1,
  "695": -1,
  "696": -1,
  "697": -1,
  "698": -1,
  "699": -1,
  "700": -1,
  "701": -1,
  "702": -1,
  "703": -1,
  "704": -1,
  "705": -1,
  "706": -1,
  "707": -1,
  "708": -1,
  "709": -1,
  "710": 234,
  "711": 235,
  "712": -1,
  "713": -1,
  "714": -1,
  "715": -1,
  "716": -1,
  "717": -1,
  "718": -1,
  "719": -1,
  "720": 469,
  "721": 53,
  "722": 70,
  "723": 175,
  "724": 208,
  "725": -1,
  "726": -1,
  "727": -1,
  "728": -1,
  "729": -1,
  "730": 468,
  "731": 52,
  "732": 69,
  "733": 174,
  "734": 207,
  "735": -1,
  "736": -1,
  "737": -1,
  "738": -1,
  "739": -1,
  "740": 470,
  "741": 54,
  "742": 71,
  "743": 176,
  "744": 209,
  "745": -1,
  "746": -1,
  "747": -1,
  "748": -1,
  "749": -1,
  "750": 471,
  "751": 55,
  "752": 72,
  "753": 177,
  "754": 210,
  "755": 401,
  "756": 47,
  "757": -1,
  "758": -1,
  "759": 21,
  "760": -1,
  "761": -1,
  "762": 83,
  "763": 68,
  "764": -1,
  "765": -1,
  "766": -1,
  "767": -1,
  "768": 281,
  "769": -1,
  "770": -1,
  "771": 415,
  "772": -1,
  "773": 192,
  "774": -1,
  "775": -1,
  "776": -1,
  "777": 160,
  "778": -1,
  "779": -1,
  "780": -1,
  "781": -1,
  "782": 280,
  "783": -1,
  "784": 414,
  "785": 412,
  "786": -1,
  "787": -1,
  "788": -1,
  "789": -1,
  "790": 159,
  "791": 59,
  "792": -1,
  "793": -1,
  "794": -1,
  "795": 193,
  "796": 441,
  "797": 287,
  "798": -1,
  "799": -1,
  "800": -1,
  "801": 394,
  "802": -1,
  "803": 161,
  "804": -1,
  "805": 265,
  "806": 22,
  "807": 409,
  "808": 44,
  "809": 80,
  "810": 179,
  "811": 203,
  "812": 244,
  "813": 408,
  "814": 446,
  "815": 26,
  "816": 237,
  "817": 421,
  "818": 78,
  "819": -1,
  "820": 456,
  "821": -1,
  "822": -1,
  "823": -1,
  "824": -1,
  "825": -1,
  "826": -1,
  "827": -1,
  "828": -1,
  "829": -1,
  "830": -1,
  "831": -1,
  "832": -1,
  "833": -1,
  "834": -1,
  "835": -1,
  "836": -1,
  "837": -1,
  "838": -1,
  "839": -1,
  "840": -1,
  "841": -1,
  "842": -1,
  "843": -1,
  "844": -1,
  "845": -1,
  "846": -1,
  "847": -1,
  "848": -1,
  "849": -1,
  "850": -1,
  "851": -1,
  "852": -1,
  "853": -1,
  "854": -1,
  "855": -1,
  "856": -1,
  "857": -1,
  "858": -1,
  "859": -1,
  "860": -1,
  "861": -1,
  "862": -1,
  "863": -1,
  "864": 452,
  "865": 223,
  "866": -1,
  "867": -1,
  "868": 110,
  "869": 460,
  "870": 25,
  "871": -1,
  "872": -1,
  "873": -1,
  "874": -1,
  "875": -1,
  "876": -1,
  "877": -1,
  "878": -1,
  "879": -1,
  "880": -1,
  "881": -1,
  "882": -1,
  "883": 40,
  "884": 42,
  "885": 43,
  "886": 41,
  "887": -1,
  "888": 331,
  "889": 116,
  "890": 90,
  "891": -1,
  "892": 330,
  "893": -1,
  "894": 184,
  "895": -1,
  "896": -1,
  "897": -1,
  "898": -1,
  "899": -1,
  "900": -1,
  "901": -1,
  "902": -1,
  "903": 79,
  "904": 497,
  "905": -1,
  "906": -1,
  "907": -1,
  "908": -1,
  "909": -1,
  "910": -1,
  "911": -1,
  "912": -1,
  "913": -1,
  "914": -1,
  "915": -1,
  "916": -1,
  "917": -1,
  "918": 369,
  "919": -1,
  "920": -1,
  "921": -1,
  "922": -1,
  "923": -1,
  "924": -1,
  "925": -1,
  "926": -1,
  "927": -1,
  "928": -1,
  "929": -1,
  "930": -1,
  "931": -1,
  "932": -1,
  "933": -1,
  "934": -1,
  "935": -1,
  "936": -1,
  "937": 13,
  "938": 73,
  "939": 14,
  "940": 240,
  "941": 274,
  "942": 406,
  "943": 472,
  "944": -1,
  "945": -1,
  "946": -1,
  "947": 338,
  "948": 339,
  "949": -1,
  "950": -1,
  "951": 93,
  "952": 473,
  "953": -1,
  "954": -1,
  "955": -1,
  "956": 94,
  "957": 77,
  "958": -1,
  "959": 353,
  "960": 397,
  "961": -1,
  "962": 395,
  "963": 399,
  "964": 396,
  "965": 398,
  "966": 111,
  "967": -1,
  "968": -1,
  "969": -1,
  "970": 112,
  "971": 145,
  "972": 317,
  "973": -1,
  "974": -1,
  "975": -1,
  "976": -1,
  "977": -1,
  "978": -1,
  "979": -1,
  "980": 487,
  "981": -1,
  "982": -1,
  "983": 479,
  "984": -1,
  "985": -1,
  "986": -1,
  "987": -1,
  "988": -1,
  "989": -1,
  "990": -1,
  "991": -1,
  "992": 480,
  "993": -1,
  "994": -1,
  "995": 488,
  "996": 492,
  "997": -1,
  "998": -1,
  "999": 484,
  "1000": 494,
  "1001": -1,
  "1002": -1,
  "1003": 486,
  "1004": 493,
  "1005": -1,
  "1006": -1,
  "1007": 485,
  "1008": -1,
  "1009": -1,
  "1010": -1,
  "1011": -1,
  "1012": 482,
  "1013": -1,
  "1014": 489,
  "1015": -1,
  "1016": -1,
  "1017": -1,
  "1018": 316,
  "1019": -1,
  "1020": -1,
  "1021": -1,
  "1022": 491,
  "1023": -1,
  "1024": -1,
  "1025": -1,
  "1026": -1,
  "1027": -1,
  "1028": 483,
  "1029": -1,
  "1030": -1,
  "1031": 490,
  "1032": -1,
  "1033": -1,
  "1034": -1,
  "1035": -1,
  "1036": 481,
  "1037": -1,
  "1038": -1,
  "1039": -1,
  "1040": -1,
  "1041": 327,
  "1042": 166,
  "1043": 84,
  "1044": 85,
  "1045": 424,
  "1046": 18,
  "1047": 181,
  "1048": 278,
  "1049": 323,
  "1050": 506,
  "1051": 243,
  "1052": 277,
  "1053": 27,
  "1054": 28,
  "1055": 407,
  "1056": 204,
  "1057": 388,
  "1058": 284,
  "1059": 139,
  "1060": 99,
  "1061": 101,
  "1062": 100,
  "1063": 102,
  "1064": 332,
  "1065": 334,
  "1066": 333,
  "1067": 335,
  "1068": 155,
  "1069": 153,
  "1070": 152,
  "1071": 154,
  "1072": 143,
  "1073": 141,
  "1074": 140,
  "1075": 142,
  "1076": 89,
  "1077": 114,
  "1078": 115,
  "1079": 214,
  "1080": 410,
  "1081": 367,
  "1082": 366,
  "1083": -1,
  "1084": -1,
  "1085": -1,
  "1086": -1,
  "1087": -1,
  "1088": -1,
  "1089": -1,
  "1090": 386,
  "1091": 138,
  "1092": -1,
  "1093": 465,
  "1094": 474,
  "1095": -1,
  "1096": -1,
  "1097": -1,
  "1098": -1,
  "1099": -1,
  "1100": -1,
  "1101": -1,
  "1102": -1,
  "1103": 178
}