{
  "minecraft:acacia_door": 1,
  "minecraft:acacia_fence": 2,
  "minecraft:acacia_fence_gate": 3,
  "minecraft:acacia_leaves": 4,
  "minecraft:acacia_log": 5,
  "minecraft:acacia_planks": 6,
  "minecraft:acacia_pressure_plate": 7,
  "minecraft:acacia_sapling": 8,
  "minecraft:acacia_slab": 9,
  "minecraft:acacia_stairs": 10,
  "minecraft:acacia_wood": 11,
  "minecraft:air": 0,
  "minecraft:allium": 12,
  "minecraft:amethyst_block": 13,
  "minecraft:amethyst_cluster": 14,
  "minecraft:andesite": 15,
  "minecraft:attached_melon_stem": 16,
  "minecraft:attached_pumpkin_stem": 17,
  "minecraft:azalea": 18,
  "minecraft:azalea_leaves": 19,
  "minecraft:azure_bluet": 20,
  "minecraft:bamboo": 21,
  "minecraft:barrel": 22,
  "minecraft:basalt": 23,
  "minecraft:bedrock": 24,
  "minecraft:bee_nest": 25,
  "minecraft:bell": 26,
  "minecraft:big_dripleaf": 27,
  "minecraft:big_dripleaf_stem": 28,
  "minecraft:birch_fence": 29,
  "minecraft:birch_leaves": 30,
  "minecraft:birch_log": 31,
  "minecraft:birch_planks": 32,
  "minecraft:birch_slab": 33,
  "minecraft:birch_stairs": 34,
  "minecraft:black_bed": 35,
  "minecraft:black_carpet": 36,
  "minecraft:black_glazed_terracotta": 37,
  "minecraft:black_stained_glass": 38,
  "minecraft:black_wool": 39,
  "minecraft:blackstone": 40,
  "minecraft:blackstone_slab": 41,
  "minecraft:blackstone_stairs": 42,
  "minecraft:blackstone_wall": 43,
  "minecraft:blast_furnace": 44,
  "minecraft:blue_bed": 45,
  "minecraft:blue_carpet": 46,
  "minecraft:blue_ice": 47,
  "minecraft:blue_terracotta": 48,
  "minecraft:blue_wool": 49,
  "minecraft:bone_block": 50,
  "minecraft:bookshelf": 51,
  "minecraft:brain_coral": 52,
  "minecraft:brain_coral_block": 53,
  "minecraft:brain_coral_fan": 54,
  "minecraft:brain_coral_wall_fan": 55,
  "minecraft:brewing_stand": 56,
  "minecraft:brick_slab": 57,
  "minecraft:brick_stairs": 58,
  "minecraft:brick_wall": 59,
  "minecraft:bricks": 60,
  "minecraft:brown_bed": 61,
  "minecraft:brown_carpet": 62,
  "minecraft:brown_mushroom": 63,
  "minecraft:brown_mushroom_block": 64,
  "minecraft:brown_stained_glass": 65,
  "minecraft:brown_terracotta": 66,
  "minecraft:brown_wool": 67,
  "minecraft:bubble_column": 68,
  "minecraft:bubble_coral": 69,
  "minecraft:bubble_coral_block": 70,
  "minecraft:bubble_coral_fan": 71,
  "minecraft:bubble_coral_wall_fan": 72,
  "minecraft:budding_amethyst": 73,
  "minecraft:bush": 74,
  "minecraft:cactus": 75,
  "minecraft:cactus_flower": 76,
  "minecraft:calcite": 77,
  "minecraft:campfire": 78,
  "minecraft:candle": 79,
  "minecraft:cartography_table": 80,
  "minecraft:carved_pumpkin": 81,
  "minecraft:cauldron": 82,
  "minecraft:cave_air": 83,
  "minecraft:cave_vines": 84,
  "minecraft:cave_vines_plant": 85,
  "minecraft:cherry_leaves": 86,
  "minecraft:cherry_log": 87,
  "minecraft:chest": 88,
  "minecraft:chiseled_deepslate": 89,
  "minecraft:chiseled_polished_blackstone": 90,
  "minecraft:chiseled_sandstone": 91,
  "minecraft:chiseled_stone_bricks": 92,
  "minecraft:chiseled_tuff": 93,
  "minecraft:chiseled_tuff_bricks": 94,
  "minecraft:clay": 95,
  "minecraft:coal_block": 96,
  "minecraft:coal_ore": 97,
  "minecraft:coarse_dirt": 98,
  "minecraft:cobbled_deepslate": 99,
  "minecraft:cobbled_deepslate_slab": 100,
  "minecraft:cobbled_deepslate_stairs": 101,
  "minecraft:cobbled_deepslate_wall": 102,
  "minecraft:cobblestone": 103,
  "minecraft:cobblestone_slab": 104,
  "minecraft:cobblestone_stairs": 105,
  "minecraft:cobblestone_wall": 106,
  "minecraft:cobweb": 107,
  "minecraft:cocoa": 108,
  "minecraft:comparator": 109,
  "minecraft:composter": 110,
  "minecraft:copper_block": 111,
  "minecraft:copper_ore": 112,
  "minecraft:cornflower": 113,
  "minecraft:cracked_deepslate_bricks": 114,
  "minecraft:cracked_deepslate_tiles": 115,
  "minecraft:cracked_polished_blackstone_bricks": 116,
  "minecraft:cracked_stone_bricks": 117,
  "minecraft:crafting_table": 118,
  "minecraft:cut_sandstone": 119,
  "minecraft:cyan_bed": 120,
  "minecraft:cyan_carpet": 121,
  "minecraft:cyan_glazed_terracotta": 122,
  "minecraft:cyan_terracotta": 123,
  "minecraft:cyan_wool": 124,
  "minecraft:damaged_anvil": 125,
  "minecraft:dandelion": 126,
  "minecraft:dark_oak_door": 127,
  "minecraft:dark_oak_fence": 128,
  "minecraft:dark_oak_fence_gate": 129,
  "minecraft:dark_oak_leaves": 130,
  "minecraft:dark_oak_log": 131,
  "minecraft:dark_oak_planks": 132,
  "minecraft:dark_oak_sapling": 133,
  "minecraft:dark_oak_slab": 134,
  "minecraft:dark_oak_stairs": 135,
  "minecraft:dark_oak_trapdoor": 136,
  "minecraft:dead_bush": 137,
  "minecraft:decorated_pot": 138,
  "minecraft:deepslate": 139,
  "minecraft:deepslate_brick_slab": 140,
  "minecraft:deepslate_brick_stairs": 141,
  "minecraft:deepslate_brick_wall": 142,
  "minecraft:deepslate_bricks": 143,
  "minecraft:deepslate_coal_ore": 144,
  "minecraft:deepslate_copper_ore": 145,
  "minecraft:deepslate_diamond_ore": 146,
  "minecraft:deepslate_emerald_ore": 147,
  "minecraft:deepslate_gold_ore": 148,
  "minecraft:deepslate_iron_ore": 149,
  "minecraft:deepslate_lapis_ore": 150,
  "minecraft:deepslate_redstone_ore": 151,
  "minecraft:deepslate_tile_slab": 152,
  "minecraft:deepslate_tile_stairs": 153,
  "minecraft:deepslate_tile_wall": 154,
  "minecraft:deepslate_tiles": 155,
  "minecraft:diamond_block": 156,
  "minecraft:diamond_ore": 157,
  "minecraft:diorite": 158,
  "minecraft:diorite_slab": 159,
  "minecraft:diorite_stairs": 160,
  "minecraft:diorite_wall": 161,
  "minecraft:dirt": 162,
  "minecraft:dirt_path": 163,
  "minecraft:dispenser": 164,
  "minecraft:dragon_wall_head": 165,
  "minecraft:dripstone_block": 166,
  "minecraft:emerald_ore": 167,
  "minecraft:end_rod": 168,
  "minecraft:end_stone_bricks": 169,
  "minecraft:ender_chest": 170,
  "minecraft:farmland": 171,
  "minecraft:fern": 172,
  "minecraft:fire": 173,
  "minecraft:fire_coral": 174,
  "minecraft:fire_coral_block": 175,
  "minecraft:fire_coral_fan": 176,
  "minecraft:fire_coral_wall_fan": 177,
  "minecraft:firefly_bush": 178,
  "minecraft:fletching_table": 179,
  "minecraft:flower_pot": 180,
  "minecraft:flowering_azalea": 181,
  "minecraft:flowering_azalea_leaves": 182,
  "minecraft:furnace": 183,
  "minecraft:gilded_blackstone": 184,
  "minecraft:glass": 185,
  "minecraft:glass_pane": 186,
  "minecraft:glow_lichen": 187,
  "minecraft:glowstone": 188,
  "minecraft:gold_block": 189,
  "minecraft:gold_ore": 190,
  "minecraft:granite": 191,
  "minecraft:granite_stairs": 192,
  "minecraft:granite_wall": 193,
  "minecraft:grass_block": 194,
  "minecraft:gravel": 195,
  "minecraft:gray_bed": 196,
  "minecraft:gray_carpet": 197,
  "minecraft:gray_terracotta": 198,
  "minecraft:gray_wool": 199,
  "minecraft:green_bed": 200,
  "minecraft:green_carpet": 201,
  "minecraft:green_wool": 202,
  "minecraft:grindstone": 203,
  "minecraft:hanging_roots": 204,
  "minecraft:hay_block": 205,
  "minecraft:hopper": 206,
  "minecraft:horn_coral": 207,
  "minecraft:horn_coral_block": 208,
  "minecraft:horn_coral_fan": 209,
  "minecraft:horn_coral_wall_fan": 210,
  "minecraft:ice": 211,
  "minecraft:infested_chiseled_stone_bricks": 212,
  "minecraft:infested_cobblestone": 213,
  "minecraft:infested_deepslate": 214,
  "minecraft:infested_mossy_stone_bricks": 215,
  "minecraft:infested_stone": 216,
  "minecraft:infested_stone_bricks": 217,
  "minecraft:iron_bars": 218,
  "minecraft:iron_chain": 219,
  "minecraft:iron_door": 220,
  "minecraft:iron_ore": 221,
  "minecraft:iron_trapdoor": 222,
  "minecraft:jigsaw": 223,
  "minecraft:jungle_button": 224,
  "minecraft:jungle_door": 225,
  "minecraft:jungle_fence": 226,
  "minecraft:jungle_fence_gate": 227,
  "minecraft:jungle_leaves": 228,
  "minecraft:jungle_log": 229,
  "minecraft:jungle_planks": 230,
  "minecraft:jungle_slab": 231,
  "minecraft:jungle_stairs": 232,
  "minecraft:jungle_trapdoor": 233,
  "minecraft:kelp": 234,
  "minecraft:kelp_plant": 235,
  "minecraft:ladder": 236,
  "minecraft:lantern": 237,
  "minecraft:lapis_block": 238,
  "minecraft:lapis_ore": 239,
  "minecraft:large_amethyst_bud": 240,
  "minecraft:large_fern": 241,
  "minecraft:lava": 242,
  "minecraft:leaf_litter": 243,
  "minecraft:lectern": 244,
  "minecraft:lever": 245,
  "minecraft:light_blue_bed": 246,
  "minecraft:light_blue_carpet": 247,
  "minecraft:light_blue_glazed_terracotta": 248,
  "minecraft:light_blue_terracotta": 249,
  "minecraft:light_blue_wool": 250,
  "minecraft:light_gray_bed": 251,
  "minecraft:light_gray_carpet": 252,
  "minecraft:light_gray_glazed_terracotta": 253,
  "minecraft:light_gray_stained_glass": 254,
  "minecraft:light_gray_terracotta": 255,
  "minecraft:light_gray_wool": 256,
  "minecraft:lilac": 257,
  "minecraft:lily_of_the_valley": 258,
  "minecraft:lily_pad": 259,
  "minecraft:lime_bed": 260,
  "minecraft:lime_carpet": 261,
  "minecraft:lime_glazed_terracotta": 262,
  "minecraft:lime_terracotta": 263,
  "minecraft:lime_wool": 264,
  "minecraft:loom": 265,
  "minecraft:magenta_bed": 266,
  "minecraft:magenta_carpet": 267,
  "minecraft:magenta_stained_glass": 268,
  "minecraft:magma_block": 269,
  "minecraft:mangrove_leaves": 270,
  "minecraft:mangrove_log": 271,
  "minecraft:mangrove_roots": 272,
  "minecraft:mangrove_wood": 273,
  "minecraft:medium_amethyst_bud": 274,
  "minecraft:melon": 275,
  "minecraft:melon_stem": 276,
  "minecraft:moss_block": 277,
  "minecraft:moss_carpet": 278,
  "minecraft:mossy_cobblestone": 279,
  "minecraft:mossy_cobblestone_slab": 280,
  "minecraft:mossy_cobblestone_stairs": 281,
  "minecraft:mossy_cobblestone_wall": 282,
  "minecraft:mossy_stone_bricks": 283,
  "minecraft:mud": 284,
  "minecraft:mud_brick_slab": 285,
  "minecraft:mud_brick_stairs": 286,
  "minecraft:mud_brick_wall": 287,
  "minecraft:mud_bricks": 288,
  "minecraft:muddy_mangrove_roots": 289,
  "minecraft:mushroom_stem": 290,
  "minecraft:mycelium": 291,
  "minecraft:nether_wart": 292,
  "minecraft:netherrack": 293,
  "minecraft:note_block": 294,
  "minecraft:oak_button": 295,
  "minecraft:oak_door": 296,
  "minecraft:oak_fence": 297,
  "minecraft:oak_fence_gate": 298,
  "minecraft:oak_leaves": 299,
  "minecraft:oak_log": 300,
  "minecraft:oak_planks": 301,
  "minecraft:oak_pressure_plate": 302,
  "minecraft:oak_slab": 303,
  "minecraft:oak_stairs": 304,
  "minecraft:oak_trapdoor": 305,
  "minecraft:oak_wall_sign": 306,
  "minecraft:obsidian": 307,
  "minecraft:orange_bed": 308,
  "minecraft:orange_carpet": 309,
  "minecraft:orange_glazed_terracotta": 310,
  "minecraft:orange_stained_glass_pane": 311,
  "minecraft:orange_terracotta": 312,
  "minecraft:orange_tulip": 313,
  "minecraft:orange_wool": 314,
  "minecraft:oxeye_daisy": 315,
  "minecraft:oxidized_copper_trapdoor": 316,
  "minecraft:oxidized_cut_copper": 317,
  "minecraft:packed_ice": 318,
  "minecraft:packed_mud": 319,
  "minecraft:peony": 320,
  "minecraft:pink_bed": 321,
  "minecraft:pink_carpet": 322,
  "minecraft:pink_petals": 323,
  "minecraft:pink_tulip": 324,
  "minecraft:piston_head": 325,
  "minecraft:podzol": 326,
  "minecraft:pointed_dripstone": 327,
  "minecraft:polished_andesite": 328,
  "minecraft:polished_basalt": 329,
  "minecraft:polished_blackstone_brick_stairs": 330,
  "minecraft:polished_blackstone_bricks": 331,
  "minecraft:polished_deepslate": 332,
  "minecraft:polished_deepslate_slab": 333,
  "minecraft:polished_deepslate_stairs": 334,
  "minecraft:polished_deepslate_wall": 335,
  "minecraft:polished_diorite": 336,
  "minecraft:polished_granite": 337,
  "minecraft:polished_tuff": 338,
  "minecraft:polished_tuff_slab": 339,
  "minecraft:poppy": 340,
  "minecraft:potted_allium": 341,
  "minecraft:potted_azure_bluet": 342,
  "minecraft:potted_birch_sapling": 343,
  "minecraft:potted_blue_orchid": 344,
  "minecraft:potted_cactus": 345,
  "minecraft:potted_dandelion": 346,
  "minecraft:potted_dead_bush": 347,
  "minecraft:potted_oxeye_daisy": 348,
  "minecraft:potted_poppy": 349,
  "minecraft:potted_red_tulip": 350,
  "minecraft:potted_spruce_sapling": 351,
  "minecraft:potted_white_tulip": 352,
  "minecraft:powder_snow": 353,
  "minecraft:prismarine": 354,
  "minecraft:pumpkin": 355,
  "minecraft:pumpkin_stem": 356,
  "minecraft:purple_bed": 357,
  "minecraft:purple_carpet": 358,
  "minecraft:purple_glazed_terracotta": 359,
  "minecraft:purpur_block": 360,
  "minecraft:purpur_pillar": 361,
  "minecraft:purpur_slab": 362,
  "minecraft:purpur_stairs": 363,
  "minecraft:quartz_block": 364,
  "minecraft:rail": 365,
  "minecraft:raw_copper_block": 366,
  "minecraft:raw_iron_block": 367,
  "minecraft:red_bed": 368,
  "minecraft:red_candle": 369,
  "minecraft:red_carpet": 370,
  "minecraft:red_concrete": 371,
  "minecraft:red_glazed_terracotta": 372,
  "minecraft:red_mushroom": 373,
  "minecraft:red_mushroom_block": 374,
  "minecraft:red_sand": 375,
  "minecraft:red_sandstone": 376,
  "minecraft:red_terracotta": 377,
  "minecraft:red_tulip": 378,
  "minecraft:red_wool": 379,
  "minecraft:redstone_block": 380,
  "minecraft:redstone_lamp": 381,
  "minecraft:redstone_ore": 382,
  "minecraft:redstone_torch": 383,
  "minecraft:redstone_wall_torch": 384,
  "minecraft:redstone_wire": 385,
  "minecraft:reinforced_deepslate": 386,
  "minecraft:repeater": 387,
  "minecraft:rooted_dirt": 388,
  "minecraft:rose_bush": 389,
  "minecraft:sand": 390,
  "minecraft:sandstone": 391,
  "minecraft:sandstone_slab": 392,
  "minecraft:sandstone_stairs": 393,
  "minecraft:sandstone_wall": 394,
  "minecraft:sculk": 395,
  "minecraft:sculk_catalyst": 396,
  "minecraft:sculk_sensor": 397,
  "minecraft:sculk_shrieker": 398,
  "minecraft:sculk_vein": 399,
  "minecraft:sea_lantern": 400,
  "minecraft:sea_pickle": 401,
  "minecraft:seagrass": 402,
  "minecraft:short_dry_grass": 403,
  "minecraft:short_grass": 404,
  "minecraft:skeleton_skull": 405,
  "minecraft:small_amethyst_bud": 406,
  "minecraft:small_dripleaf": 407,
  "minecraft:smithing_table": 408,
  "minecraft:smoker": 409,
  "minecraft:smooth_basalt": 410,
  "minecraft:smooth_quartz": 411,
  "minecraft:smooth_quartz_slab": 412,
  "minecraft:smooth_sandstone": 413,
  "minecraft:smooth_sandstone_slab": 414,
  "minecraft:smooth_sandstone_stairs": 415,
  "minecraft:smooth_stone": 416,
  "minecraft:smooth_stone_slab": 417,
  "minecraft:snow": 418,
  "minecraft:snow_block": 419,
  "minecraft:soul_fire": 420,
  "minecraft:soul_lantern": 421,
  "minecraft:soul_sand": 422,
  "minecraft:spawner": 423,
  "minecraft:spore_blossom": 424,
  "minecraft:spruce_door": 425,
  "minecraft:spruce_fence": 426,
  "minecraft:spruce_fence_gate": 427,
  "minecraft:spruce_leaves": 428,
  "minecraft:spruce_log": 429,
  "minecraft:spruce_planks": 430,
  "minecraft:spruce_pressure_plate": 431,
  "minecraft:spruce_slab": 432,
  "minecraft:spruce_stairs": 433,
  "minecraft:spruce_trapdoor": 434,
  "minecraft:spruce_wall_sign": 435,
  "minecraft:spruce_wood": 436,
  "minecraft:sticky_piston": 437,
  "minecraft:stone": 438,
  "minecraft:stone_brick_slab": 439,
  "minecraft:stone_brick_stairs": 440,
  "minecraft:stone_brick_wall": 441,
  "minecraft:stone_bricks": 442,
  "minecraft:stone_button": 443,
  "minecraft:stone_pressure_plate": 444,
  "minecraft:stone_slab": 445,
  "minecraft:stonecutter": 446,
  "minecraft:stripped_acacia_log": 447,
  "minecraft:stripped_oak_log": 448,
  "minecraft:stripped_oak_wood": 449,
  "minecraft:stripped_spruce_log": 450,
  "minecraft:stripped_spruce_wood": 451,
  "minecraft:structure_block": 452,
  "minecraft:sugar_cane": 453,
  "minecraft:sunflower": 454,
  "minecraft:suspicious_sand": 455,
  "minecraft:sweet_berry_bush": 456,
  "minecraft:tall_dry_grass": 457,
  "minecraft:tall_grass": 458,
  "minecraft:tall_seagrass": 459,
  "minecraft:target": 460,
  "minecraft:terracotta": 461,
  "minecraft:tnt": 462,
  "minecraft:torch": 463,
  "minecraft:trapped_chest": 464,
  "minecraft:trial_spawner": 465,
  "minecraft:tripwire": 466,
  "minecraft:tripwire_hook": 467,
  "minecraft:tube_coral": 468,
  "minecraft:tube_coral_block": 469,
  "minecraft:tube_coral_fan": 470,
  "minecraft:tube_coral_wall_fan": 471,
  "minecraft:tuff": 472,
  "minecraft:tuff_bricks": 473,
  "minecraft:vault": 474,
  "minecraft:vine": 475,
  "minecraft:wall_torch": 476,
  "minecraft:water": 477,
  "minecraft:water_cauldron": 478,
  "minecraft:waxed_chiseled_copper": 479,
  "minecraft:waxed_copper_block": 480,
  "minecraft:waxed_copper_bulb": 481,
  "minecraft:waxed_copper_door": 482,
  "minecraft:waxed_copper_grate": 483,
  "minecraft:waxed_cut_copper": 484,
  "minecraft:waxed_cut_copper_slab": 485,
  "minecraft:waxed_cut_copper_stairs": 486,
  "minecraft:waxed_oxidized_chiseled_copper": 487,
  "minecraft:waxed_oxidized_copper": 488,
  "minecraft:waxed_oxidized_copper_door": 489,
  "minecraft:waxed_oxidized_copper_grate": 490,
  "minecraft:waxed_oxidized_copper_trapdoor": 491,
  "minecraft:waxed_oxidized_cut_copper": 492,
  "minecraft:waxed_oxidized_cut_copper_slab": 493,
  "minecraft:waxed_oxidized_cut_copper_stairs": 494,
  "minecraft:wheat": 495,
  "minecraft:white_bed": 496,
  "minecraft:white_candle": 497,
  "minecraft:white_carpet": 498,
  "minecraft:white_concrete": 499,
  "minecraft:white_glazed_terracotta": 500,
  "minecraft:white_stained_glass": 501,
  "minecraft:white_stained_glass_pane": 502,
  "minecraft:white_terracotta": 503,
  "minecraft:white_tulip": 504,
  "minecraft:white_wool": 505,
  "minecraft:wildflowers": 506,
  "minecraft:yellow_bed": 507,
  "minecraft:yellow_carpet": 508,
  "minecraft:yellow_glazed_terracotta": 509,
  "minecraft:yellow_stained_glass_pane": 510,
  "minecraft:yellow_terracotta": 511,
  "minecraft:yellow_wool": 512
}