{
  "minecraft:acacia_button": 1,
  "minecraft:acacia_door": 2,
  "minecraft:acacia_fence": 3,
  "minecraft:acacia_fence_gate": 4,
  "minecraft:acacia_hanging_sign": 5,
  "minecraft:acacia_leaves": 6,
  "minecraft:acacia_log": 7,
  "minecraft:acacia_planks": 8,
  "minecraft:acacia_pressure_plate": 9,
  "minecraft:acacia_sapling": 10,
  "minecraft:acacia_sign": 11,
  "minecraft:acacia_slab": 12,
  "minecraft:acacia_stairs": 13,
  "minecraft:acacia_trapdoor": 14,
  "minecraft:acacia_wall_hanging_sign": 15,
  "minecraft:acacia_wall_sign": 16,
  "minecraft:acacia_wood": 17,
  "minecraft:activator_rail": 18,
  "minecraft:air": 0,
  "minecraft:allium": 19,
  "minecraft:amethyst_block": 20,
  "minecraft:amethyst_cluster": 21,
  "minecraft:ancient_debris": 22,
  "minecraft:andesite": 23,
  "minecraft:andesite_slab": 24,
  "minecraft:andesite_stairs": 25,
  "minecraft:andesite_wall": 26,
  "minecraft:anvil": 27,
  "minecraft:attached_melon_stem": 28,
  "minecraft:attached_pumpkin_stem": 29,
  "minecraft:azalea": 30,
  "minecraft:azalea_leaves": 31,
  "minecraft:azure_bluet": 32,
  "minecraft:bamboo": 33,
  "minecraft:bamboo_block": 34,
  "minecraft:bamboo_button": 35,
  "minecraft:bamboo_door": 36,
  "minecraft:bamboo_fence": 37,
  "minecraft:bamboo_fence_gate": 38,
  "minecraft:bamboo_hanging_sign": 39,
  "minecraft:bamboo_mosaic": 40,
  "minecraft:bamboo_mosaic_slab": 41,
  "minecraft:bamboo_mosaic_stairs": 42,
  "minecraft:bamboo_planks": 43,
  "minecraft:bamboo_pressure_plate": 44,
  "minecraft:bamboo_sapling": 45,
  "minecraft:bamboo_sign": 46,
  "minecraft:bamboo_slab": 47,
  "minecraft:bamboo_stairs": 48,
  "minecraft:bamboo_trapdoor": 49,
  "minecraft:bamboo_wall_hanging_sign": 50,
  "minecraft:bamboo_wall_sign": 51,
  "minecraft:barrel": 52,
  "minecraft:barrier": 53,
  "minecraft:basalt": 54,
  "minecraft:beacon": 55,
  "minecraft:bedrock": 56,
  "minecraft:bee_nest": 57,
  "minecraft:beehive": 58,
  "minecraft:beetroots": 59,
  "minecraft:bell": 60,
  "minecraft:big_dripleaf": 61,
  "minecraft:big_dripleaf_stem": 62,
  "minecraft:birch_button": 63,
  "minecraft:birch_door": 64,
  "minecraft:birch_fence": 65,
  "minecraft:birch_fence_gate": 66,
  "minecraft:birch_hanging_sign": 67,
  "minecraft:birch_leaves": 68,
  "minecraft:birch_log": 69,
  "minecraft:birch_planks": 70,
  "minecraft:birch_pressure_plate": 71,
  "minecraft:birch_sapling": 72,
  "minecraft:birch_sign": 73,
  "minecraft:birch_slab": 74,
  "minecraft:birch_stairs": 75,
  "minecraft:birch_trapdoor": 76,
  "minecraft:birch_wall_hanging_sign": 77,
  "minecraft:birch_wall_sign": 78,
  "minecraft:birch_wood": 79,
  "minecraft:black_banner": 80,
  "minecraft:black_bed": 81,
  "minecraft:black_candle": 82,
  "minecraft:black_candle_cake": 83,
  "minecraft:black_carpet": 84,
  "minecraft:black_concrete": 85,
  "minecraft:black_concrete_powder": 86,
  "minecraft:black_glazed_terracotta": 87,
  "minecraft:black_shulker_box": 88,
  "minecraft:black_stained_glass": 89,
  "minecraft:black_stained_glass_pane": 90,
  "minecraft:black_terracotta": 91,
  "minecraft:black_wall_banner": 92,
  "minecraft:black_wool": 93,
  "minecraft:blackstone": 94,
  "minecraft:blackstone_slab": 95,
  "minecraft:blackstone_stairs": 96,
  "minecraft:blackstone_wall": 97,
  "minecraft:blast_furnace": 98,
  "minecraft:blue_banner": 99,
  "minecraft:blue_bed": 100,
  "minecraft:blue_candle": 101,
  "minecraft:blue_candle_cake": 102,
  "minecraft:blue_carpet": 103,
  "minecraft:blue_concrete": 104,
  "minecraft:blue_concrete_powder": 105,
  "minecraft:blue_glazed_terracotta": 106,
  "minecraft:blue_ice": 107,
  "minecraft:blue_orchid": 108,
  "minecraft:blue_shulker_box": 109,
  "minecraft:blue_stained_glass": 110,
  "minecraft:blue_stained_glass_pane": 111,
  "minecraft:blue_terracotta": 112,
  "minecraft:blue_wall_banner": 113,
  "minecraft:blue_wool": 114,
  "minecraft:bone_block": 115,
  "minecraft:bookshelf": 116,
  "minecraft:brain_coral": 117,
  "minecraft:brain_coral_block": 118,
  "minecraft:brain_coral_fan": 119,
  "minecraft:brain_coral_wall_fan": 120,
  "minecraft:brewing_stand": 121,
  "minecraft:brick_slab": 122,
  "minecraft:brick_stairs": 123,
  "minecraft:brick_wall": 124,
  "minecraft:bricks": 125,
  "minecraft:brown_banner": 126,
  "minecraft:brown_bed": 127,
  "minecraft:brown_candle": 128,
  "minecraft:brown_candle_cake": 129,
  "minecraft:brown_carpet": 130,
  "minecraft:brown_concrete": 131,
  "minecraft:brown_concrete_powder": 132,
  "minecraft:brown_glazed_terracotta": 133,
  "minecraft:brown_mushroom": 134,
  "minecraft:brown_mushroom_block": 135,
  "minecraft:brown_shulker_box": 136,
  "minecraft:brown_stained_glass": 137,
  "minecraft:brown_stained_glass_pane": 138,
  "minecraft:brown_terracotta": 139,
  "minecraft:brown_wall_banner": 140,
  "minecraft:brown_wool": 141,
  "minecraft:bubble_column": 142,
  "minecraft:bubble_coral": 143,
  "minecraft:bubble_coral_block": 144,
  "minecraft:bubble_coral_fan": 145,
  "minecraft:bubble_coral_wall_fan": 146,
  "minecraft:budding_amethyst": 147,
  "minecraft:bush": 148,
  "minecraft:cactus": 149,
  "minecraft:cactus_flower": 150,
  "minecraft:cake": 151,
  "minecraft:calcite": 152,
  "minecraft:calibrated_sculk_sensor": 153,
  "minecraft:campfire": 154,
  "minecraft:candle": 155,
  "minecraft:candle_cake": 156,
  "minecraft:carrots": 157,
  "minecraft:cartography_table": 158,
  "minecraft:carved_pumpkin": 159,
  "minecraft:cauldron": 160,
  "minecraft:cave_air": 161,
  "minecraft:cave_vines": 162,
  "minecraft:cave_vines_plant": 163,
  "minecraft:chain_command_block": 164,
  "minecraft:cherry_button": 165,
  "minecraft:cherry_door": 166,
  "minecraft:cherry_fence": 167,
  "minecraft:cherry_fence_gate": 168,
  "minecraft:cherry_hanging_sign": 169,
  "minecraft:cherry_leaves": 170,
  "minecraft:cherry_log": 171,
  "minecraft:cherry_planks": 172,
  "minecraft:cherry_pressure_plate": 173,
  "minecraft:cherry_sapling": 174,
  "minecraft:cherry_sign": 175,
  "minecraft:cherry_slab": 176,
  "minecraft:cherry_stairs": 177,
  "minecraft:cherry_trapdoor": 178,
  "minecraft:cherry_wall_hanging_sign": 179,
  "minecraft:cherry_wall_sign": 180,
  "minecraft:cherry_wood": 181,
  "minecraft:chest": 182,
  "minecraft:chipped_anvil": 183,
  "minecraft:chiseled_bookshelf": 184,
  "minecraft:chiseled_copper": 185,
  "minecraft:chiseled_deepslate": 186,
  "minecraft:chiseled_nether_bricks": 187,
  "minecraft:chiseled_polished_blackstone": 188,
  "minecraft:chiseled_quartz_block": 189,
  "minecraft:chiseled_red_sandstone": 190,
  "minecraft:chiseled_resin_bricks": 191,
  "minecraft:chiseled_sandstone": 192,
  "minecraft:chiseled_stone_bricks": 193,
  "minecraft:chiseled_tuff": 194,
  "minecraft:chiseled_tuff_bricks": 195,
  "minecraft:chorus_flower": 196,
  "minecraft:chorus_plant": 197,
  "minecraft:clay": 198,
  "minecraft:closed_eyeblossom": 199,
  "minecraft:coal_block": 200,
  "minecraft:coal_ore": 201,
  "minecraft:coarse_dirt": 202,
  "minecraft:cobbled_deepslate": 203,
  "minecraft:cobbled_deepslate_slab": 204,
  "minecraft:cobbled_deepslate_stairs": 205,
  "minecraft:cobbled_deepslate_wall": 206,
  "minecraft:cobblestone": 207,
  "minecraft:cobblestone_slab": 208,
  "minecraft:cobblestone_stairs": 209,
  "minecraft:cobblestone_wall": 210,
  "minecraft:cobweb": 211,
  "minecraft:cocoa": 212,
  "minecraft:command_block": 213,
  "minecraft:comparator": 214,
  "minecraft:composter": 215,
  "minecraft:conduit": 216,
  "minecraft:copper_block": 217,
  "minecraft:copper_bulb": 218,
  "minecraft:copper_door": 219,
  "minecraft:copper_grate": 220,
  "minecraft:copper_ore": 221,
  "minecraft:copper_trapdoor": 222,
  "minecraft:cornflower": 223,
  "minecraft:cracked_deepslate_bricks": 224,
  "minecraft:cracked_deepslate_tiles": 225,
  "minecraft:cracked_nether_bricks": 226,
  "minecraft:cracked_polished_blackstone_bricks": 227,
  "minecraft:cracked_stone_bricks": 228,
  "minecraft:crafter": 229,
  "minecraft:crafting_table": 230,
  "minecraft:creaking_heart": 231,
  "minecraft:creeper_head": 232,
  "minecraft:creeper_wall_head": 233,
  "minecraft:crimson_button": 234,
  "minecraft:crimson_door": 235,
  "minecraft:crimson_fence": 236,
  "minecraft:crimson_fence_gate": 237,
  "minecraft:crimson_fungus": 238,
  "minecraft:crimson_hanging_sign": 239,
  "minecraft:crimson_hyphae": 240,
  "minecraft:crimson_nylium": 241,
  "minecraft:crimson_planks": 242,
  "minecraft:crimson_pressure_plate": 243,
  "minecraft:crimson_roots": 244,
  "minecraft:crimson_sign": 245,
  "minecraft:crimson_slab": 246,
  "minecraft:crimson_stairs": 247,
  "minecraft:crimson_stem": 248,
  "minecraft:crimson_trapdoor": 249,
  "minecraft:crimson_wall_hanging_sign": 250,
  "minecraft:crimson_wall_sign": 251,
  "minecraft:crying_obsidian": 252,
  "minecraft:cut_copper": 253,
  "minecraft:cut_copper_slab": 254,
  "minecraft:cut_copper_stairs": 255,
  "minecraft:cut_red_sandstone": 256,
  "minecraft:cut_red_sandstone_slab": 257,
  "minecraft:cut_sandstone": 258,
  "minecraft:cut_sandstone_slab": 259,
  "minecraft:cyan_banner": 260,
  "minecraft:cyan_bed": 261,
  "minecraft:cyan_candle": 262,
  "minecraft:cyan_candle_cake": 263,
  "minecraft:cyan_carpet": 264,
  "minecraft:cyan_concrete": 265,
  "minecraft:cyan_concrete_powder": 266,
  "minecraft:cyan_glazed_terracotta": 267,
  "minecraft:cyan_shulker_box": 268,
  "minecraft:cyan_stained_glass": 269,
  "minecraft:cyan_stained_glass_pane": 270,
  "minecraft:cyan_terracotta": 271,
  "minecraft:cyan_wall_banner": 272,
  "minecraft:cyan_wool": 273,
  "minecraft:damaged_anvil": 274,
  "minecraft:dandelion": 275,
  "minecraft:dark_oak_button": 276,
  "minecraft:dark_oak_door": 277,
  "minecraft:dark_oak_fence": 278,
  "minecraft:dark_oak_fence_gate": 279,
  "minecraft:dark_oak_hanging_sign": 280,
  "minecraft:dark_oak_leaves": 281,
  "minecraft:dark_oak_log": 282,
  "minecraft:dark_oak_planks": 283,
  "minecraft:dark_oak_pressure_plate": 284,
  "minecraft:dark_oak_sapling": 285,
  "minecraft:dark_oak_sign": 286,
  "minecraft:dark_oak_slab": 287,
  "minecraft:dark_oak_stairs": 288,
  "minecraft:dark_oak_trapdoor": 289,
  "minecraft:dark_oak_wall_hanging_sign": 290,
  "minecraft:dark_oak_wall_sign": 291,
  "minecraft:dark_oak_wood": 292,
  "minecraft:dark_prismarine": 293,
  "minecraft:dark_prismarine_slab": 294,
  "minecraft:dark_prismarine_stairs": 295,
  "minecraft:daylight_detector": 296,
  "minecraft:dead_brain_coral": 297,
  "minecraft:dead_brain_coral_block": 298,
  "minecraft:dead_brain_coral_fan": 299,
  "minecraft:dead_brain_coral_wall_fan": 300,
  "minecraft:dead_bubble_coral": 301,
  "minecraft:dead_bubble_coral_block": 302,
  "minecraft:dead_bubble_coral_fan": 303,
  "minecraft:dead_bubble_coral_wall_fan": 304,
  "minecraft:dead_bush": 305,
  "minecraft:dead_fire_coral": 306,
  "minecraft:dead_fire_coral_block": 307,
  "minecraft:dead_fire_coral_fan": 308,
  "minecraft:dead_fire_coral_wall_fan": 309,
  "minecraft:dead_horn_coral": 310,
  "minecraft:dead_horn_coral_block": 311,
  "minecraft:dead_horn_coral_fan": 312,
  "minecraft:dead_horn_coral_wall_fan": 313,
  "minecraft:dead_tube_coral": 314,
  "minecraft:dead_tube_coral_block": 315,
  "minecraft:dead_tube_coral_fan": 316,
  "minecraft:dead_tube_coral_wall_fan": 317,
  "minecraft:decorated_pot": 318,
  "minecraft:deepslate": 319,
  "minecraft:deepslate_brick_slab": 320,
  "minecraft:deepslate_brick_stairs": 321,
  "minecraft:deepslate_brick_wall": 322,
  "minecraft:deepslate_bricks": 323,
  "minecraft:deepslate_coal_ore": 324,
  "minecraft:deepslate_copper_ore": 325,
  "minecraft:deepslate_diamond_ore": 326,
  "minecraft:deepslate_emerald_ore": 327,
  "minecraft:deepslate_gold_ore": 328,
  "minecraft:deepslate_iron_ore": 329,
  "minecraft:deepslate_lapis_ore": 330,
  "minecraft:deepslate_redstone_ore": 331,
  "minecraft:deepslate_tile_slab": 332,
  "minecraft:deepslate_tile_stairs": 333,
  "minecraft:deepslate_tile_wall": 334,
  "minecraft:deepslate_tiles": 335,
  "minecraft:detector_rail": 336,
  "minecraft:diamond_block": 337,
  "minecraft:diamond_ore": 338,
  "minecraft:diorite": 339,
  "minecraft:diorite_slab": 340,
  "minecraft:diorite_stairs": 341,
  "minecraft:diorite_wall": 342,
  "minecraft:dirt": 343,
  "minecraft:dirt_path": 344,
  "minecraft:dispenser": 345,
  "minecraft:dragon_egg": 346,
  "minecraft:dragon_head": 347,
  "minecraft:dragon_wall_head": 348,
  "minecraft:dried_kelp_block": 349,
  "minecraft:dripstone_block": 350,
  "minecraft:dropper": 351,
  "minecraft:emerald_block": 352,
  "minecraft:emerald_ore": 353,
  "minecraft:enchanting_table": 354,
  "minecraft:end_gateway": 355,
  "minecraft:end_portal": 356,
  "minecraft:end_portal_frame": 357,
  "minecraft:end_rod": 358,
  "minecraft:end_stone": 359,
  "minecraft:end_stone_brick_slab": 360,
  "minecraft:end_stone_brick_stairs": 361,
  "minecraft:end_stone_brick_wall": 362,
  "minecraft:end_stone_bricks": 363,
  "minecraft:ender_chest": 364,
  "minecraft:exposed_chiseled_copper": 365,
  "minecraft:exposed_copper": 366,
  "minecraft:exposed_copper_bulb": 367,
  "minecraft:exposed_copper_door": 368,
  "minecraft:exposed_copper_grate": 369,
  "minecraft:exposed_copper_trapdoor": 370,
  "minecraft:exposed_cut_copper": 371,
  "minecraft:exposed_cut_copper_slab": 372,
  "minecraft:exposed_cut_copper_stairs": 373,
  "minecraft:farmland": 374,
  "minecraft:fern": 375,
  "minecraft:fire": 376,
  "minecraft:fire_coral": 377,
  "minecraft:fire_coral_block": 378,
  "minecraft:fire_coral_fan": 379,
  "minecraft:fire_coral_wall_fan": 380,
  "minecraft:firefly_bush": 381,
  "minecraft:fletching_table": 382,
  "minecraft:flower_pot": 383,
  "minecraft:flowering_azalea": 384,
  "minecraft:flowering_azalea_leaves": 385,
  "minecraft:frogspawn": 386,
  "minecraft:frosted_ice": 387,
  "minecraft:furnace": 388,
  "minecraft:gilded_blackstone": 389,
  "minecraft:glass": 390,
  "minecraft:glass_pane": 391,
  "minecraft:glow_lichen": 392,
  "minecraft:glowstone": 393,
  "minecraft:gold_block": 394,
  "minecraft:gold_ore": 395,
  "minecraft:granite": 396,
  "minecraft:granite_slab": 397,
  "minecraft:granite_stairs": 398,
  "minecraft:granite_wall": 399,
  "minecraft:grass_block": 400,
  "minecraft:gravel": 401,
  "minecraft:gray_banner": 402,
  "minecraft:gray_bed": 403,
  "minecraft:gray_candle": 404,
  "minecraft:gray_candle_cake": 405,
  "minecraft:gray_carpet": 406,
  "minecraft:gray_concrete": 407,
  "minecraft:gray_concrete_powder": 408,
  "minecraft:gray_glazed_terracotta": 409,
  "minecraft:gray_shulker_box": 410,
  "minecraft:gray_stained_glass": 411,
  "minecraft:gray_stained_glass_pane": 412,
  "minecraft:gray_terracotta": 413,
  "minecraft:gray_wall_banner": 414,
  "minecraft:gray_wool": 415,
  "minecraft:green_banner": 416,
  "minecraft:green_bed": 417,
  "minecraft:green_candle": 418,
  "minecraft:green_candle_cake": 419,
  "minecraft:green_carpet": 420,
  "minecraft:green_concrete": 421,
  "minecraft:green_concrete_powder": 422,
  "minecraft:green_glazed_terracotta": 423,
  "minecraft:green_shulker_box": 424,
  "minecraft:green_stained_glass": 425,
  "minecraft:green_stained_glass_pane": 426,
  "minecraft:green_terracotta": 427,
  "minecraft:green_wall_banner": 428,
  "minecraft:green_wool": 429,
  "minecraft:grindstone": 430,
  "minecraft:hanging_roots": 431,
  "minecraft:hay_block": 432,
  "minecraft:heavy_core": 433,
  "minecraft:heavy_weighted_pressure_plate": 434,
  "minecraft:honey_block": 435,
  "minecraft:honeycomb_block": 436,
  "minecraft:hopper": 437,
  "minecraft:horn_coral": 438,
  "minecraft:horn_coral_block": 439,
  "minecraft:horn_coral_fan": 440,
  "minecraft:horn_coral_wall_fan": 441,
  "minecraft:ice": 442,
  "minecraft:infested_chiseled_stone_bricks": 443,
  "minecraft:infested_cobblestone": 444,
  "minecraft:infested_cracked_stone_bricks": 445,
  "minecraft:infested_deepslate": 446,
  "minecraft:infested_mossy_stone_bricks": 447,
  "minecraft:infested_stone": 448,
  "minecraft:infested_stone_bricks": 449,
  "minecraft:iron_bars": 450,
  "minecraft:iron_block": 451,
  "minecraft:iron_chain": 452,
  "minecraft:iron_door": 453,
  "minecraft:iron_ore": 454,
  "minecraft:iron_trapdoor": 455,
  "minecraft:jack_o_lantern": 456,
  "minecraft:jigsaw": 457,
  "minecraft:jukebox": 458,
  "minecraft:jungle_button": 459,
  "minecraft:jungle_door": 460,
  "minecraft:jungle_fence": 461,
  "minecraft:jungle_fence_gate": 462,
  "minecraft:jungle_hanging_sign": 463,
  "minecraft:jungle_leaves": 464,
  "minecraft:jungle_log": 465,
  "minecraft:jungle_planks": 466,
  "minecraft:jungle_pressure_plate": 467,
  "minecraft:jungle_sapling": 468,
  "minecraft:jungle_sign": 469,
  "minecraft:jungle_slab": 470,
  "minecraft:jungle_stairs": 471,
  "minecraft:jungle_trapdoor": 472,
  "minecraft:jungle_wall_hanging_sign": 473,
  "minecraft:jungle_wall_sign": 474,
  "minecraft:jungle_wood": 475,
  "minecraft:kelp": 476,
  "minecraft:kelp_plant": 477,
  "minecraft:ladder": 478,
  "minecraft:lantern": 479,
  "minecraft:lapis_block": 480,
  "minecraft:lapis_ore": 481,
  "minecraft:large_amethyst_bud": 482,
  "minecraft:large_fern": 483,
  "minecraft:lava": 484,
  "minecraft:lava_cauldron": 485,
  "minecraft:leaf_litter": 486,
  "minecraft:lectern": 487,
  "minecraft:lever": 488,
  "minecraft:light": 489,
  "minecraft:light_blue_banner": 490,
  "minecraft:light_blue_bed": 491,
  "minecraft:light_blue_candle": 492,
  "minecraft:light_blue_candle_cake": 493,
  "minecraft:light_blue_carpet": 494,
  "minecraft:light_blue_concrete": 495,
  "minecraft:light_blue_concrete_powder": 496,
  "minecraft:light_blue_glazed_terracotta": 497,
  "minecraft:light_blue_shulker_box": 498,
  "minecraft:light_blue_stained_glass": 499,
  "minecraft:light_blue_stained_glass_pane": 500,
  "minecraft:light_blue_terracotta": 501,
  "minecraft:light_blue_wall_banner": 502,
  "minecraft:light_blue_wool": 503,
  "minecraft:light_gray_banner": 504,
  "minecraft:light_gray_bed": 505,
  "minecraft:light_gray_candle": 506,
  "minecraft:light_gray_candle_cake": 507,
  "minecraft:light_gray_carpet": 508,
  "minecraft:light_gray_concrete": 509,
  "minecraft:light_gray_concrete_powder": 510,
  "minecraft:light_gray_glazed_terracotta": 511,
  "minecraft:light_gray_shulker_box": 512,
  "minecraft:light_gray_stained_glass": 513,
  "minecraft:light_gray_stained_glass_pane": 514,
  "minecraft:light_gray_terracotta": 515,
  "minecraft:light_gray_wall_banner": 516,
  "minecraft:light_gray_wool": 517,
  "minecraft:light_weighted_pressure_plate": 518,
  "minecraft:lightning_rod": 519,
  "minecraft:lilac": 520,
  "minecraft:lily_of_the_valley": 521,
  "minecraft:lily_pad": 522,
  "minecraft:lime_banner": 523,
  "minecraft:lime_bed": 524,
  "minecraft:lime_candle": 525,
  "minecraft:lime_candle_cake": 526,
  "minecraft:lime_carpet": 527,
  "minecraft:lime_concrete": 528,
  "minecraft:lime_concrete_powder": 529,
  "minecraft:lime_glazed_terracotta": 530,
  "minecraft:lime_shulker_box": 531,
  "minecraft:lime_stained_glass": 532,
  "minecraft:lime_stained_glass_pane": 533,
  "minecraft:lime_terracotta": 534,
  "minecraft:lime_wall_banner": 535,
  "minecraft:lime_wool": 536,
  "minecraft:lodestone": 537,
  "minecraft:loom": 538,
  "minecraft:magenta_banner": 539,
  "minecraft:magenta_bed": 540,
  "minecraft:magenta_candle": 541,
  "minecraft:magenta_candle_cake": 542,
  "minecraft:magenta_carpet": 543,
  "minecraft:magenta_concrete": 544,
  "minecraft:magenta_concrete_powder": 545,
  "minecraft:magenta_glazed_terracotta": 546,
  "minecraft:magenta_shulker_box": 547,
  "minecraft:magenta_stained_glass": 548,
  "minecraft:magenta_stained_glass_pane": 549,
  "minecraft:magenta_terracotta": 550,
  "minecraft:magenta_wall_banner": 551,
  "minecraft:magenta_wool": 552,
  "minecraft:magma_block": 553,
  "minecraft:mangrove_button": 554,
  "minecraft:mangrove_door": 555,
  "minecraft:mangrove_fence": 556,
  "minecraft:mangrove_fence_gate": 557,
  "minecraft:mangrove_hanging_sign": 558,
  "minecraft:mangrove_leaves": 559,
  "minecraft:mangrove_log": 560,
  "minecraft:mangrove_planks": 561,
  "minecraft:mangrove_pressure_plate": 562,
  "minecraft:mangrove_propagule": 563,
  "minecraft:mangrove_roots": 564,
  "minecraft:mangrove_sign": 565,
  "minecraft:mangrove_slab": 566,
  "minecraft:mangrove_stairs": 567,
  "minecraft:mangrove_trapdoor": 568,
  "minecraft:mangrove_wall_hanging_sign": 569,
  "minecraft:mangrove_wall_sign": 570,
  "minecraft:mangrove_wood": 571,
  "minecraft:medium_amethyst_bud": 572,
  "minecraft:melon": 573,
  "minecraft:melon_stem": 574,
  "minecraft:moss_block": 575,
  "minecraft:moss_carpet": 576,
  "minecraft:mossy_cobblestone": 577,
  "minecraft:mossy_cobblestone_slab": 578,
  "minecraft:mossy_cobblestone_stairs": 579,
  "minecraft:mossy_cobblestone_wall": 580,
  "minecraft:mossy_stone_brick_slab": 581,
  "minecraft:mossy_stone_brick_stairs": 582,
  "minecraft:mossy_stone_brick_wall": 583,
  "minecraft:mossy_stone_bricks": 584,
  "minecraft:moving_piston": 585,
  "minecraft:mud": 586,
  "minecraft:mud_brick_slab": 587,
  "minecraft:mud_brick_stairs": 588,
  "minecraft:mud_brick_wall": 589,
  "minecraft:mud_bricks": 590,
  "minecraft:muddy_mangrove_roots": 591,
  "minecraft:mushroom_stem": 592,
  "minecraft:mycelium": 593,
  "minecraft:nether_brick_fence": 594,
  "minecraft:nether_brick_slab": 595,
  "minecraft:nether_brick_stairs": 596,
  "minecraft:nether_brick_wall": 597,
  "minecraft:nether_bricks": 598,
  "minecraft:nether_gold_ore": 599,
  "minecraft:nether_portal": 600,
  "minecraft:nether_quartz_ore": 601,
  "minecraft:nether_sprouts": 602,
  "minecraft:nether_wart": 603,
  "minecraft:nether_wart_block": 604,
  "minecraft:netherite_block": 605,
  "minecraft:netherrack": 606,
  "minecraft:note_block": 607,
  "minecraft:oak_button": 608,
  "minecraft:oak_door": 609,
  "minecraft:oak_fence": 610,
  "minecraft:oak_fence_gate": 611,
  "minecraft:oak_hanging_sign": 612,
  "minecraft:oak_leaves": 613,
  "minecraft:oak_log": 614,
  "minecraft:oak_planks": 615,
  "minecraft:oak_pressure_plate": 616,
  "minecraft:oak_sapling": 617,
  "minecraft:oak_sign": 618,
  "minecraft:oak_slab": 619,
  "minecraft:oak_stairs": 620,
  "minecraft:oak_trapdoor": 621,
  "minecraft:oak_wall_hanging_sign": 622,
  "minecraft:oak_wall_sign": 623,
  "minecraft:oak_wood": 624,
  "minecraft:observer": 625,
  "minecraft:obsidian": 626,
  "minecraft:ochre_froglight": 627,
  "minecraft:open_eyeblossom": 628,
  "minecraft:orange_banner": 629,
  "minecraft:orange_bed": 630,
  "minecraft:orange_candle": 631,
  "minecraft:orange_candle_cake": 632,
  "minecraft:orange_carpet": 633,
  "minecraft:orange_concrete": 634,
  "minecraft:orange_concrete_powder": 635,
  "minecraft:orange_glazed_terracotta": 636,
  "minecraft:orange_shulker_box": 637,
  "minecraft:orange_stained_glass": 638,
  "minecraft:orange_stained_glass_pane": 639,
  "minecraft:orange_terracotta": 640,
  "minecraft:orange_tulip": 641,
  "minecraft:orange_wall_banner": 642,
  "minecraft:orange_wool": 643,
  "minecraft:oxeye_daisy": 644,
  "minecraft:oxidized_chiseled_copper": 645,
  "minecraft:oxidized_copper": 646,
  "minecraft:oxidized_copper_bulb": 647,
  "minecraft:oxidized_copper_door": 648,
  "minecraft:oxidized_copper_grate": 649,
  "minecraft:oxidized_copper_trapdoor": 650,
  "minecraft:oxidized_cut_copper": 651,
  "minecraft:oxidized_cut_copper_slab": 652,
  "minecraft:oxidized_cut_copper_stairs": 653,
  "minecraft:packed_ice": 654,
  "minecraft:packed_mud": 655,
  "minecraft:pale_hanging_moss": 656,
  "minecraft:pale_moss_block": 657,
  "minecraft:pale_moss_carpet": 658,
  "minecraft:pale_oak_button": 659,
  "minecraft:pale_oak_door": 660,
  "minecraft:pale_oak_fence": 661,
  "minecraft:pale_oak_fence_gate": 662,
  "minecraft:pale_oak_hanging_sign": 663,
  "minecraft:pale_oak_leaves": 664,
  "minecraft:pale_oak_log": 665,
  "minecraft:pale_oak_planks": 666,
  "minecraft:pale_oak_pressure_plate": 667,
  "minecraft:pale_oak_sapling": 668,
  "minecraft:pale_oak_sign": 669,
  "minecraft:pale_oak_slab": 670,
  "minecraft:pale_oak_stairs": 671,
  "minecraft:pale_oak_trapdoor": 672,
  "minecraft:pale_oak_wall_hanging_sign": 673,
  "minecraft:pale_oak_wall_sign": 674,
  "minecraft:pale_oak_wood": 675,
  "minecraft:pearlescent_froglight": 676,
  "minecraft:peony": 677,
  "minecraft:petrified_oak_slab": 678,
  "minecraft:piglin_head": 679,
  "minecraft:piglin_wall_head": 680,
  "minecraft:pink_banner": 681,
  "minecraft:pink_bed": 682,
  "minecraft:pink_candle": 683,
  "minecraft:pink_candle_cake": 684,
  "minecraft:pink_carpet": 685,
  "minecraft:pink_concrete": 686,
  "minecraft:pink_concrete_powder": 687,
  "minecraft:pink_glazed_terracotta": 688,
  "minecraft:pink_petals": 689,
  "minecraft:pink_shulker_box": 690,
  "minecraft:pink_stained_glass": 691,
  "minecraft:pink_stained_glass_pane": 692,
  "minecraft:pink_terracotta": 693,
  "minecraft:pink_tulip": 694,
  "minecraft:pink_wall_banner": 695,
  "minecraft:pink_wool": 696,
  "minecraft:piston": 697,
  "minecraft:piston_head": 698,
  "minecraft:pitcher_crop": 699,
  "minecraft:pitcher_plant": 700,
  "minecraft:player_head": 701,
  "minecraft:player_wall_head": 702,
  "minecraft:podzol": 703,
  "minecraft:pointed_dripstone": 704,
  "minecraft:polished_andesite": 705,
  "minecraft:polished_andesite_slab": 706,
  "minecraft:polished_andesite_stairs": 707,
  "minecraft:polished_basalt": 708,
  "minecraft:polished_blackstone": 709,
  "minecraft:polished_blackstone_brick_slab": 710,
  "minecraft:polished_blackstone_brick_stairs": 711,
  "minecraft:polished_blackstone_brick_wall": 712,
  "minecraft:polished_blackstone_bricks": 713,
  "minecraft:polished_blackstone_button": 714,
  "minecraft:polished_blackstone_pressure_plate": 715,
  "minecraft:polished_blackstone_slab": 716,
  "minecraft:polished_blackstone_stairs": 717,
  "minecraft:polished_blackstone_wall": 718,
  "minecraft:polished_deepslate": 719,
  "minecraft:polished_deepslate_slab": 720,
  "minecraft:polished_deepslate_stairs": 721,
  "minecraft:polished_deepslate_wall": 722,
  "minecraft:polished_diorite": 723,
  "minecraft:polished_diorite_slab": 724,
  "minecraft:polished_diorite_stairs": 725,
  "minecraft:polished_granite": 726,
  "minecraft:polished_granite_slab": 727,
  "minecraft:polished_granite_stairs": 728,
  "minecraft:polished_tuff": 729,
  "minecraft:polished_tuff_slab": 730,
  "minecraft:polished_tuff_stairs": 731,
  "minecraft:polished_tuff_wall": 732,
  "minecraft:poppy": 733,
  "minecraft:potatoes": 734,
  "minecraft:potted_acacia_sapling": 735,
  "minecraft:potted_allium": 736,
  "minecraft:potted_azalea_bush": 737,
  "minecraft:potted_azure_bluet": 738,
  "minecraft:potted_bamboo": 739,
  "minecraft:potted_birch_sapling": 740,
  "minecraft:potted_blue_orchid": 741,
  "minecraft:potted_brown_mushroom": 742,
  "minecraft:potted_cactus": 743,
  "minecraft:potted_cherry_sapling": 744,
  "minecraft:potted_closed_eyeblossom": 745,
  "minecraft:potted_cornflower": 746,
  "minecraft:potted_crimson_fungus": 747,
  "minecraft:potted_crimson_roots": 748,
  "minecraft:potted_dandelion": 749,
  "minecraft:potted_dark_oak_sapling": 750,
  "minecraft:potted_dead_bush": 751,
  "minecraft:potted_fern": 752,
  "minecraft:potted_flowering_azalea_bush": 753,
  "minecraft:potted_jungle_sapling": 754,
  "minecraft:potted_lily_of_the_valley": 755,
  "minecraft:potted_mangrove_propagule": 756,
  "minecraft:potted_oak_sapling": 757,
  "minecraft:potted_open_eyeblossom": 758,
  "minecraft:potted_orange_tulip": 759,
  "minecraft:potted_oxeye_daisy": 760,
  "minecraft:potted_pale_oak_sapling": 761,
  "minecraft:potted_pink_tulip": 762,
  "minecraft:potted_poppy": 763,
  "minecraft:potted_red_mushroom": 764,
  "minecraft:potted_red_tulip": 765,
  "minecraft:potted_spruce_sapling": 766,
  "minecraft:potted_torchflower": 767,
  "minecraft:potted_warped_fungus": 768,
  "minecraft:potted_warped_roots": 769,
  "minecraft:potted_white_tulip": 770,
  "minecraft:potted_wither_rose": 771,
  "minecraft:powder_snow": 772,
  "minecraft:powder_snow_cauldron": 773,
  "minecraft:powered_rail": 774,
  "minecraft:prismarine": 775,
  "minecraft:prismarine_brick_slab": 776,
  "minecraft:prismarine_brick_stairs": 777,
  "minecraft:prismarine_bricks": 778,
  "minecraft:prismarine_slab": 779,
  "minecraft:prismarine_stairs": 780,
  "minecraft:prismarine_wall": 781,
  "minecraft:pumpkin": 782,
  "minecraft:pumpkin_stem": 783,
  "minecraft:purple_banner": 784,
  "minecraft:purple_bed": 785,
  "minecraft:purple_candle": 786,
  "minecraft:purple_candle_cake": 787,
  "minecraft:purple_carpet": 788,
  "minecraft:purple_concrete": 789,
  "minecraft:purple_concrete_powder": 790,
  "minecraft:purple_glazed_terracotta": 791,
  "minecraft:purple_shulker_box": 792,
  "minecraft:purple_stained_glass": 793,
  "minecraft:purple_stained_glass_pane": 794,
  "minecraft:purple_terracotta": 795,
  "minecraft:purple_wall_banner": 796,
  "minecraft:purple_wool": 797,
  "minecraft:purpur_block": 798,
  "minecraft:purpur_pillar": 799,
  "minecraft:purpur_slab": 800,
  "minecraft:purpur_stairs": 801,
  "minecraft:quartz_block": 802,
  "minecraft:quartz_bricks": 803,
  "minecraft:quartz_pillar": 804,
  "minecraft:quartz_slab": 805,
  "minecraft:quartz_stairs": 806,
  "minecraft:rail": 807,
  "minecraft:raw_copper_block": 808,
  "minecraft:raw_gold_block": 809,
  "minecraft:raw_iron_block": 810,
  "minecraft:red_banner": 811,
  "minecraft:red_bed": 812,
  "minecraft:red_candle": 813,
  "minecraft:red_candle_cake": 814,
  "minecraft:red_carpet": 815,
  "minecraft:red_concrete": 816,
  "minecraft:red_concrete_powder": 817,
  "minecraft:red_glazed_terracotta": 818,
  "minecraft:red_mushroom": 819,
  "minecraft:red_mushroom_block": 820,
  "minecraft:red_nether_brick_slab": 821,
  "minecraft:red_nether_brick_stairs": 822,
  "minecraft:red_nether_brick_wall": 823,
  "minecraft:red_nether_bricks": 824,
  "minecraft:red_sand": 825,
  "minecraft:red_sandstone": 826,
  "minecraft:red_sandstone_slab": 827,
  "minecraft:red_sandstone_stairs": 828,
  "minecraft:red_sandstone_wall": 829,
  "minecraft:red_shulker_box": 830,
  "minecraft:red_stained_glass": 831,
  "minecraft:red_stained_glass_pane": 832,
  "minecraft:red_terracotta": 833,
  "minecraft:red_tulip": 834,
  "minecraft:red_wall_banner": 835,
  "minecraft:red_wool": 836,
  "minecraft:redstone_block": 837,
  "minecraft:redstone_lamp": 838,
  "minecraft:redstone_ore": 839,
  "minecraft:redstone_torch": 840,
  "minecraft:redstone_wall_torch": 841,
  "minecraft:redstone_wire": 842,
  "minecraft:reinforced_deepslate": 843,
  "minecraft:repeater": 844,
  "minecraft:repeating_command_block": 845,
  "minecraft:resin_block": 846,
  "minecraft:resin_brick_slab": 847,
  "minecraft:resin_brick_stairs": 848,
  "minecraft:resin_brick_wall": 849,
  "minecraft:resin_bricks": 850,
  "minecraft:resin_clump": 851,
  "minecraft:respawn_anchor": 852,
  "minecraft:rooted_dirt": 853,
  "minecraft:rose_bush": 854,
  "minecraft:sand": 855,
  "minecraft:sandstone": 856,
  "minecraft:sandstone_slab": 857,
  "minecraft:sandstone_stairs": 858,
  "minecraft:sandstone_wall": 859,
  "minecraft:scaffolding": 860,
  "minecraft:sculk": 861,
  "minecraft:sculk_catalyst": 862,
  "minecraft:sculk_sensor": 863,
  "minecraft:sculk_shrieker": 864,
  "minecraft:sculk_vein": 865,
  "minecraft:sea_lantern": 866,
  "minecraft:sea_pickle": 867,
  "minecraft:seagrass": 868,
  "minecraft:short_dry_grass": 869,
  "minecraft:short_grass": 870,
  "minecraft:shroomlight": 871,
  "minecraft:shulker_box": 872,
  "minecraft:skeleton_skull": 873,
  "minecraft:skeleton_wall_skull": 874,
  "minecraft:slime_block": 875,
  "minecraft:small_amethyst_bud": 876,
  "minecraft:small_dripleaf": 877,
  "minecraft:smithing_table": 878,
  "minecraft:smoker": 879,
  "minecraft:smooth_basalt": 880,
  "minecraft:smooth_quartz": 881,
  "minecraft:smooth_quartz_slab": 882,
  "minecraft:smooth_quartz_stairs": 883,
  "minecraft:smooth_red_sandstone": 884,
  "minecraft:smooth_red_sandstone_slab": 885,
  "minecraft:smooth_red_sandstone_stairs": 886,
  "minecraft:smooth_sandstone": 887,
  "minecraft:smooth_sandstone_slab": 888,
  "minecraft:smooth_sandstone_stairs": 889,
  "minecraft:smooth_stone": 890,
  "minecraft:smooth_stone_slab": 891,
  "minecraft:sniffer_egg": 892,
  "minecraft:snow": 893,
  "minecraft:snow_block": 894,
  "minecraft:soul_campfire": 895,
  "minecraft:soul_fire": 896,
  "minecraft:soul_lantern": 897,
  "minecraft:soul_sand": 898,
  "minecraft:soul_soil": 899,
  "minecraft:soul_torch": 900,
  "minecraft:soul_wall_torch": 901,
  "minecraft:spawner": 902,
  "minecraft:sponge": 903,
  "minecraft:spore_blossom": 904,
  "minecraft:spruce_button": 905,
  "minecraft:spruce_door": 906,
  "minecraft:spruce_fence": 907,
  "minecraft:spruce_fence_gate": 908,
  "minecraft:spruce_hanging_sign": 909,
  "minecraft:spruce_leaves": 910,
  "minecraft:spruce_log": 911,
  "minecraft:spruce_planks": 912,
  "minecraft:spruce_pressure_plate": 913,
  "minecraft:spruce_sapling": 914,
  "minecraft:spruce_sign": 915,
  "minecraft:spruce_slab": 916,
  "minecraft:spruce_stairs": 917,
  "minecraft:spruce_trapdoor": 918,
  "minecraft:spruce_wall_hanging_sign": 919,
  "minecraft:spruce_wall_sign": 920,
  "minecraft:spruce_wood": 921,
  "minecraft:sticky_piston": 922,
  "minecraft:stone": 923,
  "minecraft:stone_brick_slab": 924,
  "minecraft:stone_brick_stairs": 925,
  "minecraft:stone_brick_wall": 926,
  "minecraft:stone_bricks": 927,
  "minecraft:stone_button": 928,
  "minecraft:stone_pressure_plate": 929,
  "minecraft:stone_slab": 930,
  "minecraft:stone_stairs": 931,
  "minecraft:stonecutter": 932,
  "minecraft:stripped_acacia_log": 933,
  "minecraft:stripped_acacia_wood": 934,
  "minecraft:stripped_bamboo_block": 935,
  "minecraft:stripped_birch_log": 936,
  "minecraft:stripped_birch_wood": 937,
  "minecraft:stripped_cherry_log": 938,
  "minecraft:stripped_cherry_wood": 939,
  "minecraft:stripped_crimson_hyphae": 940,
  "minecraft:stripped_crimson_stem": 941,
  "minecraft:stripped_dark_oak_log": 942,
  "minecraft:stripped_dark_oak_wood": 943,
  "minecraft:stripped_jungle_log": 944,
  "minecraft:stripped_jungle_wood": 945,
  "minecraft:stripped_mangrove_log": 946,
  "minecraft:stripped_mangrove_wood": 947,
  "minecraft:stripped_oak_log": 948,
  "minecraft:stripped_oak_wood": 949,
  "minecraft:stripped_pale_oak_log": 950,
  "minecraft:stripped_pale_oak_wood": 951,
  "minecraft:stripped_spruce_log": 952,
  "minecraft:stripped_spruce_wood": 953,
  "minecraft:stripped_warped_hyphae": 954,
  "minecraft:stripped_warped_stem": 955,
  "minecraft:structure_block": 956,
  "minecraft:structure_void": 957,
  "minecraft:sugar_cane": 958,
  "minecraft:sunflower": 959,
  "minecraft:suspicious_gravel": 960,
  "minecraft:suspicious_sand": 961,
  "minecraft:sweet_berry_bush": 962,
  "minecraft:tall_dry_grass": 963,
  "minecraft:tall_grass": 964,
  "minecraft:tall_seagrass": 965,
  "minecraft:target": 966,
  "minecraft:terracotta": 967,
  "minecraft:test_block": 968,
  "minecraft:test_instance_block": 969,
  "minecraft:tinted_glass": 970,
  "minecraft:tnt": 971,
  "minecraft:torch": 972,
  "minecraft:torchflower": 973,
  "minecraft:torchflower_crop": 974,
  "minecraft:trapped_chest": 975,
  "minecraft:trial_spawner": 976,
  "minecraft:tripwire": 977,
  "minecraft:tripwire_hook": 978,
  "minecraft:tube_coral": 979,
  "minecraft:tube_coral_block": 980,
  "minecraft:tube_coral_fan": 981,
  "minecraft:tube_coral_wall_fan": 982,
  "minecraft:tuff": 983,
  "minecraft:tuff_brick_slab": 984,
  "minecraft:tuff_brick_stairs": 985,
  "minecraft:tuff_brick_wall": 986,
  "minecraft:tuff_bricks": 987,
  "minecraft:tuff_slab": 988,
  "minecraft:tuff_stairs": 989,
  "minecraft:tuff_wall": 990,
  "minecraft:turtle_egg": 991,
  "minecraft:twisting_vines": 992,
  "minecraft:twisting_vines_plant": 993,
  "minecraft:vault": 994,
  "minecraft:verdant_froglight": 995,
  "minecraft:vine": 996,
  "minecraft:void_air": 997,
  "minecraft:wall_torch": 998,
  "minecraft:warped_button": 999,
  "minecraft:warped_door": 1000,
  "minecraft:warped_fence": 1001,
  "minecraft:warped_fence_gate": 1002,
  "minecraft:warped_fungus": 1003,
  "minecraft:warped_hanging_sign": 1004,
  "minecraft:warped_hyphae": 1005,
  "minecraft:warped_nylium": 1006,
  "minecraft:warped_planks": 1007,
  "minecraft:warped_pressure_plate": 1008,
  "minecraft:warped_roots": 1009,
  "minecraft:warped_sign": 1010,
  "minecraft:warped_slab": 1011,
  "minecraft:warped_stairs": 1012,
  "minecraft:warped_stem": 1013,
  "minecraft:warped_trapdoor": 1014,
  "minecraft:warped_wall_hanging_sign": 1015,
  "minecraft:warped_wall_sign": 1016,
  "minecraft:warped_wart_block": 1017,
  "minecraft:water": 1018,
  "minecraft:water_cauldron": 1019,
  "minecraft:waxed_chiseled_copper": 1020,
  "minecraft:waxed_copper_block": 1021,
  "minecraft:waxed_copper_bulb": 1022,
  "minecraft:waxed_copper_door": 1023,
  "minecraft:waxed_copper_grate": 1024,
  "minecraft:waxed_copper_trapdoor": 1025,
  "minecraft:waxed_cut_copper": 1026,
  "minecraft:waxed_cut_copper_slab": 1027,
  "minecraft:waxed_cut_copper_stairs": 1028,
  "minecraft:waxed_exposed_chiseled_copper": 1029,
  "minecraft:waxed_exposed_copper": 1030,
  "minecraft:waxed_exposed_copper_bulb": 1031,
  "minecraft:waxed_exposed_copper_door": 1032,
  "minecraft:waxed_exposed_copper_grate": 1033,
  "minecraft:waxed_exposed_copper_trapdoor": 1034,
  "minecraft:waxed_exposed_cut_copper": 1035,
  "minecraft:waxed_exposed_cut_copper_slab": 1036,
  "minecraft:waxed_exposed_cut_copper_stairs": 1037,
  "minecraft:waxed_oxidized_chiseled_copper": 1038,
  "minecraft:waxed_oxidized_copper": 1039,
  "minecraft:waxed_oxidized_copper_bulb": 1040,
  "minecraft:waxed_oxidized_copper_door": 1041,
  "minecraft:waxed_oxidized_copper_grate": 1042,
  "minecraft:waxed_oxidized_copper_trapdoor": 1043,
  "minecraft:waxed_oxidized_cut_copper": 1044,
  "minecraft:waxed_oxidized_cut_copper_slab": 1045,
  "minecraft:waxed_oxidized_cut_copper_stairs": 1046,
  "minecraft:waxed_weathered_chiseled_copper": 1047,
  "minecraft:waxed_weathered_copper": 1048,
  "minecraft:waxed_weathered_copper_bulb": 1049,
  "minecraft:waxed_weathered_copper_door": 1050,
  "minecraft:waxed_weathered_copper_grate": 1051,
  "minecraft:waxed_weathered_copper_trapdoor": 1052,
  "minecraft:waxed_weathered_cut_copper": 1053,
  "minecraft:waxed_weathered_cut_copper_slab": 1054,
  "minecraft:waxed_weathered_cut_copper_stairs": 1055,
  "minecraft:weathered_chiseled_copper": 1056,
  "minecraft:weathered_copper": 1057,
  "minecraft:weathered_copper_bulb": 1058,
  "minecraft:weathered_copper_door": 1059,
  "minecraft:weathered_copper_grate": 1060,
  "minecraft:weathered_copper_trapdoor": 1061,
  "minecraft:weathered_cut_copper": 1062,
  "minecraft:weathered_cut_copper_slab": 1063,
  "minecraft:weathered_cut_copper_stairs": 1064,
  "minecraft:weeping_vines": 1065,
  "minecraft:weeping_vines_plant": 1066,
  "minecraft:wet_sponge": 1067,
  "minecraft:wheat": 1068,
  "minecraft:white_banner": 1069,
  "minecraft:white_bed": 1070,
  "minecraft:white_candle": 1071,
  "minecraft:white_candle_cake": 1072,
  "minecraft:white_carpet": 1073,
  "minecraft:white_concrete": 1074,
  "minecraft:white_concrete_powder": 1075,
  "minecraft:white_glazed_terracotta": 1076,
  "minecraft:white_shulker_box": 1077,
  "minecraft:white_stained_glass": 1078,
  "minecraft:white_stained_glass_pane": 1079,
  "minecraft:white_terracotta": 1080,
  "minecraft:white_tulip": 1081,
  "minecraft:white_wall_banner": 1082,
  "minecraft:white_wool": 1083,
  "minecraft:wildflowers": 1084,
  "minecraft:wither_rose": 1085,
  "minecraft:wither_skeleton_skull": 1086,
  "minecraft:wither_skeleton_wall_skull": 1087,
  "minecraft:yellow_banner": 1088,
  "minecraft:yellow_bed": 1089,
  "minecraft:yellow_candle": 1090,
  "minecraft:yellow_candle_cake": 1091,
  "minecraft:yellow_carpet": 1092,
  "minecraft:yellow_concrete": 1093,
  "minecraft:yellow_concrete_powder": 1094,
  "minecraft:yellow_glazed_terracotta": 1095,
  "minecraft:yellow_shulker_box": 1096,
  "minecraft:yellow_stained_glass": 1097,
  "minecraft:yellow_stained_glass_pane": 1098,
  "minecraft:yellow_terracotta": 1099,
  "minecraft:yellow_wall_banner": 1100,
  "minecraft:yellow_wool": 1101,
  "minecraft:zombie_head": 1102,
  "minecraft:zombie_wall_head": 1103
}