{
  "minecraft:acacia_button": 1,
  "minecraft:acacia_door": 2,
  "minecraft:acacia_fence": 3,
  "minecraft:acacia_fence_gate": 4,
  "minecraft:acacia_hanging_sign": 5,
  "minecraft:acacia_leaves": 6,
  "minecraft:acacia_log": 7,
  "minecraft:acacia_planks": 8,
  "minecraft:acacia_pressure_plate": 9,
  "minecraft:acacia_sapling": 10,
  "minecraft:acacia_sign": 11,
  "minecraft:acacia_slab": 12,
  "minecraft:acacia_stairs": 13,
  "minecraft:acacia_trapdoor": 14,
  "minecraft:acacia_wall_hanging_sign": 15,
  "minecraft:acacia_wall_sign": 16,
  "minecraft:acacia_wood": 17,
  "minecraft:activator_rail": 18,
  "minecraft:air": 0,
  "minecraft:allium": 19,
  "minecraft:amethyst_block": 20,
  "minecraft:amethyst_cluster": 21,
  "minecraft:ancient_debris": 22,
  "minecraft:andesite": 23,
  "minecraft:andesite_slab": 24,
  "minecraft:andesite_stairs": 25,
  "minecraft:andesite_wall": 26,
  "minecraft:anvil": 27,
  "minecraft:attached_melon_stem": 28,
  "minecraft:attached_pumpkin_stem": 29,
  "minecraft:azalea": 30,
  "minecraft:azalea_leaves": 31,
  "minecraft:azure_bluet": 32,
  "minecraft:bamboo": 33,
  "minecraft:bamboo_block": 34,
  "minecraft:bamboo_button": 35,
  "minecraft:bamboo_door": 36,
  "minecraft:bamboo_fence": 37,
  "minecraft:bamboo_fence_gate": 38,
  "minecraft:bamboo_hanging_sign": 39,
  "minecraft:bamboo_mosaic": 40,
  "minecraft:bamboo_mosaic_slab": 41,
  "minecraft:bamboo_mosaic_stairs": 42,
  "minecraft:bamboo_planks": 43,
  "minecraft:bamboo_pressure_plate": 44,
  "minecraft:bamboo_sapling": 45,
  "minecraft:bamboo_sign": 46,
  "minecraft:bamboo_slab": 47,
  "minecraft:bamboo_stairs": 48,
  "minecraft:bamboo_trapdoor": 49,
  "minecraft:bamboo_wall_hanging_sign": 50,
  "minecraft:bamboo_wall_sign": 51,
  "minecraft:barrel": 52,
  "minecraft:barrier": 53,
  "minecraft:basalt": 54,
  "minecraft:beacon": 55,
  "minecraft:bedrock": 56,
  "minecraft:bee_nest": 57,
  "minecraft:beehive": 58,
  "minecraft:beetroots": 59,
  "minecraft:bell": 60,
  "minecraft:big_dripleaf": 61,
  "minecraft:big_dripleaf_stem": 62,
  "minecraft:birch_button": 63,
  "minecraft:birch_door": 64,
  "minecraft:birch_fence": 65,
  "minecraft:birch_fence_gate": 66,
  "minecraft:birch_hanging_sign": 67,
  "minecraft:birch_leaves": 68,
  "minecraft:birch_log": 69,
  "minecraft:birch_planks": 70,
  "minecraft:birch_pressure_plate": 71,
  "minecraft:birch_sapling": 72,
  "minecraft:birch_sign": 73,
  "minecraft:birch_slab": 74,
  "minecraft:birch_stairs": 75,
  "minecraft:birch_trapdoor": 76,
  "minecraft:birch_wall_hanging_sign": 77,
  "minecraft:birch_wall_sign": 78,
  "minecraft:birch_wood": 79,
  "minecraft:black_banner": 80,
  "minecraft:black_bed": 81,
  "minecraft:black_candle": 82,
  "minecraft:black_candle_cake": 83,
  "minecraft:black_carpet": 84,
  "minecraft:black_concrete": 85,
  "minecraft:black_concrete_powder": 86,
  "minecraft:black_glazed_terracotta": 87,
  "minecraft:black_shulker_box": 88,
  "minecraft:black_stained_glass": 89,
  "minecraft:black_stained_glass_pane": 90,
  "minecraft:black_terracotta": 91,
  "minecraft:black_wall_banner": 92,
  "minecraft:black_wool": 93,
  "minecraft:blackstone": 94,
  "minecraft:blackstone_slab": 95,
  "minecraft:blackstone_stairs": 96,
  "minecraft:blackstone_wall": 97,
  "minecraft:blast_furnace": 98,
  "minecraft:blue_banner": 99,
  "minecraft:blue_bed": 100,
  "minecraft:blue_candle": 101,
  "minecraft:blue_candle_cake": 102,
  "minecraft:blue_carpet": 103,
  "minecraft:blue_concrete": 104,
  "minecraft:blue_concrete_powder": 105,
  "minecraft:blue_glazed_terracotta": 106,
  "minecraft:blue_ice": 107,
  "minecraft:blue_orchid": 108,
  "minecraft:blue_shulker_box": 109,
  "minecraft:blue_stained_glass": 110,
  "minecraft:blue_stained_glass_pane": 111,
  "minecraft:blue_terracotta": 112,
  "minecraft:blue_wall_banner": 113,
  "minecraft:blue_wool": 114,
  "minecraft:bone_block": 115,
  "minecraft:bookshelf": 116,
  "minecraft:brain_coral": 117,
  "minecraft:brain_coral_block": 118,
  "minecraft:brain_coral_fan": 119,
  "minecraft:brain_coral_wall_fan": 120,
  "minecraft:brewing_stand": 121,
  "minecraft:brick_slab": 122,
  "minecraft:brick_stairs": 123,
  "minecraft:brick_wall": 124,
  "minecraft:bricks": 125,
  "minecraft:brown_banner": 126,
  "minecraft:brown_bed": 127,
  "minecraft:brown_candle": 128,
  "minecraft:brown_candle_cake": 129,
  "minecraft:brown_carpet": 130,
  "minecraft:brown_concrete": 131,
  "minecraft:brown_concrete_powder": 132,
  "minecraft:brown_glazed_terracotta": 133,
  "minecraft:brown_mushroom": 134,
  "minecraft:brown_mushroom_block": 135,
  "minecraft:brown_shulker_box": 136,
  "minecraft:brown_stained_glass": 137,
  "minecraft:brown_stained_glass_pane": 138,
  "minecraft:brown_terracotta": 139,
  "minecraft:brown_wall_banner": 140,
  "minecraft:brown_wool": 141,
  "minecraft:bubble_column": 142,
  "minecraft:bubble_coral": 143,
  "minecraft:bubble_coral_block": 144,
  "minecraft:bubble_coral_fan": 145,
  "minecraft:bubble_coral_wall_fan": 146,
  "minecraft:budding_amethyst": 147,
  "minecraft:bush": 148,
  "minecraft:cactus": 149,
  "minecraft:cactus_flower": 150,
  "minecraft:cake": 151,
  "minecraft:calcite": 152,
  "minecraft:calibrated_sculk_sensor": 153,
  "minecraft:campfire": 154,
  "minecraft:candle": 155,
  "minecraft:candle_cake": 156,
  "minecraft:carrots": 157,
  "minecraft:cartography_table": 158,
  "minecraft:carved_pumpkin": 159,
  "minecraft:cauldron": 160,
  "minecraft:cave_vines": 161,
  "minecraft:cave_vines_plant": 162,
  "minecraft:chain_command_block": 163,
  "minecraft:cherry_button": 164,
  "minecraft:cherry_door": 165,
  "minecraft:cherry_fence": 166,
  "minecraft:cherry_fence_gate": 167,
  "minecraft:cherry_hanging_sign": 168,
  "minecraft:cherry_leaves": 169,
  "minecraft:cherry_log": 170,
  "minecraft:cherry_planks": 171,
  "minecraft:cherry_pressure_plate": 172,
  "minecraft:cherry_sapling": 173,
  "minecraft:cherry_sign": 174,
  "minecraft:cherry_slab": 175,
  "minecraft:cherry_stairs": 176,
  "minecraft:cherry_trapdoor": 177,
  "minecraft:cherry_wall_hanging_sign": 178,
  "minecraft:cherry_wall_sign": 179,
  "minecraft:cherry_wood": 180,
  "minecraft:chest": 181,
  "minecraft:chipped_anvil": 182,
  "minecraft:chiseled_bookshelf": 183,
  "minecraft:chiseled_copper": 184,
  "minecraft:chiseled_deepslate": 185,
  "minecraft:chiseled_nether_bricks": 186,
  "minecraft:chiseled_polished_blackstone": 187,
  "minecraft:chiseled_quartz_block": 188,
  "minecraft:chiseled_red_sandstone": 189,
  "minecraft:chiseled_resin_bricks": 190,
  "minecraft:chiseled_sandstone": 191,
  "minecraft:chiseled_stone_bricks": 192,
  "minecraft:chiseled_tuff": 193,
  "minecraft:chiseled_tuff_bricks": 194,
  "minecraft:chorus_flower": 195,
  "minecraft:chorus_plant": 196,
  "minecraft:clay": 197,
  "minecraft:closed_eyeblossom": 198,
  "minecraft:coal_block": 199,
  "minecraft:coal_ore": 200,
  "minecraft:coarse_dirt": 201,
  "minecraft:cobbled_deepslate": 202,
  "minecraft:cobbled_deepslate_slab": 203,
  "minecraft:cobbled_deepslate_stairs": 204,
  "minecraft:cobbled_deepslate_wall": 205,
  "minecraft:cobblestone": 206,
  "minecraft:cobblestone_slab": 207,
  "minecraft:cobblestone_stairs": 208,
  "minecraft:cobblestone_wall": 209,
  "minecraft:cobweb": 210,
  "minecraft:cocoa": 211,
  "minecraft:command_block": 212,
  "minecraft:comparator": 213,
  "minecraft:composter": 214,
  "minecraft:conduit": 215,
  "minecraft:copper_block": 216,
  "minecraft:copper_bulb": 217,
  "minecraft:copper_door": 218,
  "minecraft:copper_grate": 219,
  "minecraft:copper_ore": 220,
  "minecraft:copper_trapdoor": 221,
  "minecraft:cornflower": 222,
  "minecraft:cracked_deepslate_bricks": 223,
  "minecraft:cracked_deepslate_tiles": 224,
  "minecraft:cracked_nether_bricks": 225,
  "minecraft:cracked_polished_blackstone_bricks": 226,
  "minecraft:cracked_stone_bricks": 227,
  "minecraft:crafter": 228,
  "minecraft:crafting_table": 229,
  "minecraft:creaking_heart": 230,
  "minecraft:creeper_head": 231,
  "minecraft:creeper_wall_head": 232,
  "minecraft:crimson_button": 233,
  "minecraft:crimson_door": 234,
  "minecraft:crimson_fence": 235,
  "minecraft:crimson_fence_gate": 236,
  "minecraft:crimson_fungus": 237,
  "minecraft:crimson_hanging_sign": 238,
  "minecraft:crimson_hyphae": 239,
  "minecraft:crimson_nylium": 240,
  "minecraft:crimson_planks": 241,
  "minecraft:crimson_pressure_plate": 242,
  "minecraft:crimson_roots": 243,
  "minecraft:crimson_sign": 244,
  "minecraft:crimson_slab": 245,
  "minecraft:crimson_stairs": 246,
  "minecraft:crimson_stem": 247,
  "minecraft:crimson_trapdoor": 248,
  "minecraft:crimson_wall_hanging_sign": 249,
  "minecraft:crimson_wall_sign": 250,
  "minecraft:crying_obsidian": 251,
  "minecraft:cut_copper": 252,
  "minecraft:cut_copper_slab": 253,
  "minecraft:cut_copper_stairs": 254,
  "minecraft:cut_red_sandstone": 255,
  "minecraft:cut_red_sandstone_slab": 256,
  "minecraft:cut_sandstone": 257,
  "minecraft:cut_sandstone_slab": 258,
  "minecraft:cyan_banner": 259,
  "minecraft:cyan_bed": 260,
  "minecraft:cyan_candle": 261,
  "minecraft:cyan_candle_cake": 262,
  "minecraft:cyan_carpet": 263,
  "minecraft:cyan_concrete": 264,
  "minecraft:cyan_concrete_powder": 265,
  "minecraft:cyan_glazed_terracotta": 266,
  "minecraft:cyan_shulker_box": 267,
  "minecraft:cyan_stained_glass": 268,
  "minecraft:cyan_stained_glass_pane": 269,
  "minecraft:cyan_terracotta": 270,
  "minecraft:cyan_wall_banner": 271,
  "minecraft:cyan_wool": 272,
  "minecraft:damaged_anvil": 273,
  "minecraft:dandelion": 274,
  "minecraft:dark_oak_button": 275,
  "minecraft:dark_oak_door": 276,
  "minecraft:dark_oak_fence": 277,
  "minecraft:dark_oak_fence_gate": 278,
  "minecraft:dark_oak_hanging_sign": 279,
  "minecraft:dark_oak_leaves": 280,
  "minecraft:dark_oak_log": 281,
  "minecraft:dark_oak_planks": 282,
  "minecraft:dark_oak_pressure_plate": 283,
  "minecraft:dark_oak_sapling": 284,
  "minecraft:dark_oak_sign": 285,
  "minecraft:dark_oak_slab": 286,
  "minecraft:dark_oak_stairs": 287,
  "minecraft:dark_oak_trapdoor": 288,
  "minecraft:dark_oak_wall_hanging_sign": 289,
  "minecraft:dark_oak_wall_sign": 290,
  "minecraft:dark_oak_wood": 291,
  "minecraft:dark_prismarine": 292,
  "minecraft:dark_prismarine_slab": 293,
  "minecraft:dark_prismarine_stairs": 294,
  "minecraft:daylight_detector": 295,
  "minecraft:dead_brain_coral": 296,
  "minecraft:dead_brain_coral_block": 297,
  "minecraft:dead_brain_coral_fan": 298,
  "minecraft:dead_brain_coral_wall_fan": 299,
  "minecraft:dead_bubble_coral": 300,
  "minecraft:dead_bubble_coral_block": 301,
  "minecraft:dead_bubble_coral_fan": 302,
  "minecraft:dead_bubble_coral_wall_fan": 303,
  "minecraft:dead_bush": 304,
  "minecraft:dead_fire_coral": 305,
  "minecraft:dead_fire_coral_block": 306,
  "minecraft:dead_fire_coral_fan": 307,
  "minecraft:dead_fire_coral_wall_fan": 308,
  "minecraft:dead_horn_coral": 309,
  "minecraft:dead_horn_coral_block": 310,
  "minecraft:dead_horn_coral_fan": 311,
  "minecraft:dead_horn_coral_wall_fan": 312,
  "minecraft:dead_tube_coral": 313,
  "minecraft:dead_tube_coral_block": 314,
  "minecraft:dead_tube_coral_fan": 315,
  "minecraft:dead_tube_coral_wall_fan": 316,
  "minecraft:decorated_pot": 317,
  "minecraft:deepslate": 318,
  "minecraft:deepslate_brick_slab": 319,
  "minecraft:deepslate_brick_stairs": 320,
  "minecraft:deepslate_brick_wall": 321,
  "minecraft:deepslate_bricks": 322,
  "minecraft:deepslate_coal_ore": 323,
  "minecraft:deepslate_copper_ore": 324,
  "minecraft:deepslate_diamond_ore": 325,
  "minecraft:deepslate_emerald_ore": 326,
  "minecraft:deepslate_gold_ore": 327,
  "minecraft:deepslate_iron_ore": 328,
  "minecraft:deepslate_lapis_ore": 329,
  "minecraft:deepslate_redstone_ore": 330,
  "minecraft:deepslate_tile_slab": 331,
  "minecraft:deepslate_tile_stairs": 332,
  "minecraft:deepslate_tile_wall": 333,
  "minecraft:deepslate_tiles": 334,
  "minecraft:detector_rail": 335,
  "minecraft:diamond_block": 336,
  "minecraft:diamond_ore": 337,
  "minecraft:diorite": 338,
  "minecraft:diorite_slab": 339,
  "minecraft:diorite_stairs": 340,
  "minecraft:diorite_wall": 341,
  "minecraft:dirt": 342,
  "minecraft:dirt_path": 343,
  "minecraft:dispenser": 344,
  "minecraft:dragon_egg": 345,
  "minecraft:dragon_head": 346,
  "minecraft:dragon_wall_head": 347,
  "minecraft:dried_kelp_block": 348,
  "minecraft:dripstone_block": 349,
  "minecraft:dropper": 350,
  "minecraft:emerald_block": 351,
  "minecraft:emerald_ore": 352,
  "minecraft:enchanting_table": 353,
  "minecraft:end_gateway": 354,
  "minecraft:end_portal": 355,
  "minecraft:end_portal_frame": 356,
  "minecraft:end_rod": 357,
  "minecraft:end_stone": 358,
  "minecraft:end_stone_brick_slab": 359,
  "minecraft:end_stone_brick_stairs": 360,
  "minecraft:end_stone_brick_wall": 361,
  "minecraft:end_stone_bricks": 362,
  "minecraft:ender_chest": 363,
  "minecraft:exposed_chiseled_copper": 364,
  "minecraft:exposed_copper": 365,
  "minecraft:exposed_copper_bulb": 366,
  "minecraft:exposed_copper_door": 367,
  "minecraft:exposed_copper_grate": 368,
  "minecraft:exposed_copper_trapdoor": 369,
  "minecraft:exposed_cut_copper": 370,
  "minecraft:exposed_cut_copper_slab": 371,
  "minecraft:exposed_cut_copper_stairs": 372,
  "minecraft:farmland": 373,
  "minecraft:fern": 374,
  "minecraft:fire": 375,
  "minecraft:fire_coral": 376,
  "minecraft:fire_coral_block": 377,
  "minecraft:fire_coral_fan": 378,
  "minecraft:fire_coral_wall_fan": 379,
  "minecraft:firefly_bush": 380,
  "minecraft:fletching_table": 381,
  "minecraft:flower_pot": 382,
  "minecraft:flowering_azalea": 383,
  "minecraft:flowering_azalea_leaves": 384,
  "minecraft:frogspawn": 385,
  "minecraft:frosted_ice": 386,
  "minecraft:furnace": 387,
  "minecraft:gilded_blackstone": 388,
  "minecraft:glass": 389,
  "minecraft:glass_pane": 390,
  "minecraft:glow_lichen": 391,
  "minecraft:glowstone": 392,
  "minecraft:gold_block": 393,
  "minecraft:gold_ore": 394,
  "minecraft:granite": 395,
  "minecraft:granite_slab": 396,
  "minecraft:granite_stairs": 397,
  "minecraft:granite_wall": 398,
  "minecraft:grass_block": 399,
  "minecraft:gravel": 400,
  "minecraft:gray_banner": 401,
  "minecraft:gray_bed": 402,
  "minecraft:gray_candle": 403,
  "minecraft:gray_candle_cake": 404,
  "minecraft:gray_carpet": 405,
  "minecraft:gray_concrete": 406,
  "minecraft:gray_concrete_powder": 407,
  "minecraft:gray_glazed_terracotta": 408,
  "minecraft:gray_shulker_box": 409,
  "minecraft:gray_stained_glass": 410,
  "minecraft:gray_stained_glass_pane": 411,
  "minecraft:gray_terracotta": 412,
  "minecraft:gray_wall_banner": 413,
  "minecraft:gray_wool": 414,
  "minecraft:green_banner": 415,
  "minecraft:green_bed": 416,
  "minecraft:green_candle": 417,
  "minecraft:green_candle_cake": 418,
  "minecraft:green_carpet": 419,
  "minecraft:green_concrete": 420,
  "minecraft:green_concrete_powder": 421,
  "minecraft:green_glazed_terracotta": 422,
  "minecraft:green_shulker_box": 423,
  "minecraft:green_stained_glass": 424,
  "minecraft:green_stained_glass_pane": 425,
  "minecraft:green_terracotta": 426,
  "minecraft:green_wall_banner": 427,
  "minecraft:green_wool": 428,
  "minecraft:grindstone": 429,
  "minecraft:hanging_roots": 430,
  "minecraft:hay_block": 431,
  "minecraft:heavy_core": 432,
  "minecraft:heavy_weighted_pressure_plate": 433,
  "minecraft:honey_block": 434,
  "minecraft:honeycomb_block": 435,
  "minecraft:hopper": 436,
  "minecraft:horn_coral": 437,
  "minecraft:horn_coral_block": 438,
  "minecraft:horn_coral_fan": 439,
  "minecraft:horn_coral_wall_fan": 440,
  "minecraft:ice": 441,
  "minecraft:infested_chiseled_stone_bricks": 442,
  "minecraft:infested_cobblestone": 443,
  "minecraft:infested_cracked_stone_bricks": 444,
  "minecraft:infested_deepslate": 445,
  "minecraft:infested_mossy_stone_bricks": 446,
  "minecraft:infested_stone": 447,
  "minecraft:infested_stone_bricks": 448,
  "minecraft:iron_bars": 449,
  "minecraft:iron_block": 450,
  "minecraft:iron_chain": 451,
  "minecraft:iron_door": 452,
  "minecraft:iron_ore": 453,
  "minecraft:iron_trapdoor": 454,
  "minecraft:jack_o_lantern": 455,
  "minecraft:jigsaw": 456,
  "minecraft:jukebox": 457,
  "minecraft:jungle_button": 458,
  "minecraft:jungle_door": 459,
  "minecraft:jungle_fence": 460,
  "minecraft:jungle_fence_gate": 461,
  "minecraft:jungle_hanging_sign": 462,
  "minecraft:jungle_leaves": 463,
  "minecraft:jungle_log": 464,
  "minecraft:jungle_planks": 465,
  "minecraft:jungle_pressure_plate": 466,
  "minecraft:jungle_sapling": 467,
  "minecraft:jungle_sign": 468,
  "minecraft:jungle_slab": 469,
  "minecraft:jungle_stairs": 470,
  "minecraft:jungle_trapdoor": 471,
  "minecraft:jungle_wall_hanging_sign": 472,
  "minecraft:jungle_wall_sign": 473,
  "minecraft:jungle_wood": 474,
  "minecraft:kelp": 475,
  "minecraft:kelp_plant": 476,
  "minecraft:ladder": 477,
  "minecraft:lantern": 478,
  "minecraft:lapis_block": 479,
  "minecraft:lapis_ore": 480,
  "minecraft:large_amethyst_bud": 481,
  "minecraft:large_fern": 482,
  "minecraft:lava": 483,
  "minecraft:lava_cauldron": 484,
  "minecraft:leaf_litter": 485,
  "minecraft:lectern": 486,
  "minecraft:lever": 487,
  "minecraft:light": 488,
  "minecraft:light_blue_banner": 489,
  "minecraft:light_blue_bed": 490,
  "minecraft:light_blue_candle": 491,
  "minecraft:light_blue_candle_cake": 492,
  "minecraft:light_blue_carpet": 493,
  "minecraft:light_blue_concrete": 494,
  "minecraft:light_blue_concrete_powder": 495,
  "minecraft:light_blue_glazed_terracotta": 496,
  "minecraft:light_blue_shulker_box": 497,
  "minecraft:light_blue_stained_glass": 498,
  "minecraft:light_blue_stained_glass_pane": 499,
  "minecraft:light_blue_terracotta": 500,
  "minecraft:light_blue_wall_banner": 501,
  "minecraft:light_blue_wool": 502,
  "minecraft:light_gray_banner": 503,
  "minecraft:light_gray_bed": 504,
  "minecraft:light_gray_candle": 505,
  "minecraft:light_gray_candle_cake": 506,
  "minecraft:light_gray_carpet": 507,
  "minecraft:light_gray_concrete": 508,
  "minecraft:light_gray_concrete_powder": 509,
  "minecraft:light_gray_glazed_terracotta": 510,
  "minecraft:light_gray_shulker_box": 511,
  "minecraft:light_gray_stained_glass": 512,
  "minecraft:light_gray_stained_glass_pane": 513,
  "minecraft:light_gray_terracotta": 514,
  "minecraft:light_gray_wall_banner": 515,
  "minecraft:light_gray_wool": 516,
  "minecraft:light_weighted_pressure_plate": 517,
  "minecraft:lightning_rod": 518,
  "minecraft:lilac": 519,
  "minecraft:lily_of_the_valley": 520,
  "minecraft:lily_pad": 521,
  "minecraft:lime_banner": 522,
  "minecraft:lime_bed": 523,
  "minecraft:lime_candle": 524,
  "minecraft:lime_candle_cake": 525,
  "minecraft:lime_carpet": 526,
  "minecraft:lime_concrete": 527,
  "minecraft:lime_concrete_powder": 528,
  "minecraft:lime_glazed_terracotta": 529,
  "minecraft:lime_shulker_box": 530,
  "minecraft:lime_stained_glass": 531,
  "minecraft:lime_stained_glass_pane": 532,
  "minecraft:lime_terracotta": 533,
  "minecraft:lime_wall_banner": 534,
  "minecraft:lime_wool": 535,
  "minecraft:lodestone": 536,
  "minecraft:loom": 537,
  "minecraft:magenta_banner": 538,
  "minecraft:magenta_bed": 539,
  "minecraft:magenta_candle": 540,
  "minecraft:magenta_candle_cake": 541,
  "minecraft:magenta_carpet": 542,
  "minecraft:magenta_concrete": 543,
  "minecraft:magenta_concrete_powder": 544,
  "minecraft:magenta_glazed_terracotta": 545,
  "minecraft:magenta_shulker_box": 546,
  "minecraft:magenta_stained_glass": 547,
  "minecraft:magenta_stained_glass_pane": 548,
  "minecraft:magenta_terracotta": 549,
  "minecraft:magenta_wall_banner": 550,
  "minecraft:magenta_wool": 551,
  "minecraft:magma_block": 552,
  "minecraft:mangrove_button": 553,
  "minecraft:mangrove_door": 554,
  "minecraft:mangrove_fence": 555,
  "minecraft:mangrove_fence_gate": 556,
  "minecraft:mangrove_hanging_sign": 557,
  "minecraft:mangrove_leaves": 558,
  "minecraft:mangrove_log": 559,
  "minecraft:mangrove_planks": 560,
  "minecraft:mangrove_pressure_plate": 561,
  "minecraft:mangrove_propagule": 562,
  "minecraft:mangrove_roots": 563,
  "minecraft:mangrove_sign": 564,
  "minecraft:mangrove_slab": 565,
  "minecraft:mangrove_stairs": 566,
  "minecraft:mangrove_trapdoor": 567,
  "minecraft:mangrove_wall_hanging_sign": 568,
  "minecraft:mangrove_wall_sign": 569,
  "minecraft:mangrove_wood": 570,
  "minecraft:medium_amethyst_bud": 571,
  "minecraft:melon": 572,
  "minecraft:melon_stem": 573,
  "minecraft:moss_block": 574,
  "minecraft:moss_carpet": 575,
  "minecraft:mossy_cobblestone": 576,
  "minecraft:mossy_cobblestone_slab": 577,
  "minecraft:mossy_cobblestone_stairs": 578,
  "minecraft:mossy_cobblestone_wall": 579,
  "minecraft:mossy_stone_brick_slab": 580,
  "minecraft:mossy_stone_brick_stairs": 581,
  "minecraft:mossy_stone_brick_wall": 582,
  "minecraft:mossy_stone_bricks": 583,
  "minecraft:moving_piston": 584,
  "minecraft:mud": 585,
  "minecraft:mud_brick_slab": 586,
  "minecraft:mud_brick_stairs": 587,
  "minecraft:mud_brick_wall": 588,
  "minecraft:mud_bricks": 589,
  "minecraft:muddy_mangrove_roots": 590,
  "minecraft:mushroom_stem": 591,
  "minecraft:mycelium": 592,
  "minecraft:nether_brick_fence": 593,
  "minecraft:nether_brick_slab": 594,
  "minecraft:nether_brick_stairs": 595,
  "minecraft:nether_brick_wall": 596,
  "minecraft:nether_bricks": 597,
  "minecraft:nether_gold_ore": 598,
  "minecraft:nether_portal": 599,
  "minecraft:nether_quartz_ore": 600,
  "minecraft:nether_sprouts": 601,
  "minecraft:nether_wart": 602,
  "minecraft:nether_wart_block": 603,
  "minecraft:netherite_block": 604,
  "minecraft:netherrack": 605,
  "minecraft:note_block": 606,
  "minecraft:oak_button": 607,
  "minecraft:oak_door": 608,
  "minecraft:oak_fence": 609,
  "minecraft:oak_fence_gate": 610,
  "minecraft:oak_hanging_sign": 611,
  "minecraft:oak_leaves": 612,
  "minecraft:oak_log": 613,
  "minecraft:oak_planks": 614,
  "minecraft:oak_pressure_plate": 615,
  "minecraft:oak_sapling": 616,
  "minecraft:oak_sign": 617,
  "minecraft:oak_slab": 618,
  "minecraft:oak_stairs": 619,
  "minecraft:oak_trapdoor": 620,
  "minecraft:oak_wall_hanging_sign": 621,
  "minecraft:oak_wall_sign": 622,
  "minecraft:oak_wood": 623,
  "minecraft:observer": 624,
  "minecraft:obsidian": 625,
  "minecraft:ochre_froglight": 626,
  "minecraft:open_eyeblossom": 627,
  "minecraft:orange_banner": 628,
  "minecraft:orange_bed": 629,
  "minecraft:orange_candle": 630,
  "minecraft:orange_candle_cake": 631,
  "minecraft:orange_carpet": 632,
  "minecraft:orange_concrete": 633,
  "minecraft:orange_concrete_powder": 634,
  "minecraft:orange_glazed_terracotta": 635,
  "minecraft:orange_shulker_box": 636,
  "minecraft:orange_stained_glass": 637,
  "minecraft:orange_stained_glass_pane": 638,
  "minecraft:orange_terracotta": 639,
  "minecraft:orange_tulip": 640,
  "minecraft:orange_wall_banner": 641,
  "minecraft:orange_wool": 642,
  "minecraft:oxeye_daisy": 643,
  "minecraft:oxidized_chiseled_copper": 644,
  "minecraft:oxidized_copper": 645,
  "minecraft:oxidized_copper_bulb": 646,
  "minecraft:oxidized_copper_door": 647,
  "minecraft:oxidized_copper_grate": 648,
  "minecraft:oxidized_copper_trapdoor": 649,
  "minecraft:oxidized_cut_copper": 650,
  "minecraft:oxidized_cut_copper_slab": 651,
  "minecraft:oxidized_cut_copper_stairs": 652,
  "minecraft:packed_ice": 653,
  "minecraft:packed_mud": 654,
  "minecraft:pale_hanging_moss": 655,
  "minecraft:pale_moss_block": 656,
  "minecraft:pale_moss_carpet": 657,
  "minecraft:pale_oak_button": 658,
  "minecraft:pale_oak_door": 659,
  "minecraft:pale_oak_fence": 660,
  "minecraft:pale_oak_fence_gate": 661,
  "minecraft:pale_oak_hanging_sign": 662,
  "minecraft:pale_oak_leaves": 663,
  "minecraft:pale_oak_log": 664,
  "minecraft:pale_oak_planks": 665,
  "minecraft:pale_oak_pressure_plate": 666,
  "minecraft:pale_oak_sapling": 667,
  "minecraft:pale_oak_sign": 668,
  "minecraft:pale_oak_slab": 669,
  "minecraft:pale_oak_stairs": 670,
  "minecraft:pale_oak_trapdoor": 671,
  "minecraft:pale_oak_wall_hanging_sign": 672,
  "minecraft:pale_oak_wall_sign": 673,
  "minecraft:pale_oak_wood": 674,
  "minecraft:pearlescent_froglight": 675,
  "minecraft:peony": 676,
  "minecraft:petrified_oak_slab": 677,
  "minecraft:piglin_head": 678,
  "minecraft:piglin_wall_head": 679,
  "minecraft:pink_banner": 680,
  "minecraft:pink_bed": 681,
  "minecraft:pink_candle": 682,
  "minecraft:pink_candle_cake": 683,
  "minecraft:pink_carpet": 684,
  "minecraft:pink_concrete": 685,
  "minecraft:pink_concrete_powder": 686,
  "minecraft:pink_glazed_terracotta": 687,
  "minecraft:pink_petals": 688,
  "minecraft:pink_shulker_box": 689,
  "minecraft:pink_stained_glass": 690,
  "minecraft:pink_stained_glass_pane": 691,
  "minecraft:pink_terracotta": 692,
  "minecraft:pink_tulip": 693,
  "minecraft:pink_wall_banner": 694,
  "minecraft:pink_wool": 695,
  "minecraft:piston": 696,
  "minecraft:piston_head": 697,
  "minecraft:pitcher_crop": 698,
  "minecraft:pitcher_plant": 699,
  "minecraft:player_head": 700,
  "minecraft:player_wall_head": 701,
  "minecraft:podzol": 702,
  "minecraft:pointed_dripstone": 703,
  "minecraft:polished_andesite": 704,
  "minecraft:polished_andesite_slab": 705,
  "minecraft:polished_andesite_stairs": 706,
  "minecraft:polished_basalt": 707,
  "minecraft:polished_blackstone": 708,
  "minecraft:polished_blackstone_brick_slab": 709,
  "minecraft:polished_blackstone_brick_stairs": 710,
  "minecraft:polished_blackstone_brick_wall": 711,
  "minecraft:polished_blackstone_bricks": 712,
  "minecraft:polished_blackstone_button": 713,
  "minecraft:polished_blackstone_pressure_plate": 714,
  "minecraft:polished_blackstone_slab": 715,
  "minecraft:polished_blackstone_stairs": 716,
  "minecraft:polished_blackstone_wall": 717,
  "minecraft:polished_deepslate": 718,
  "minecraft:polished_deepslate_slab": 719,
  "minecraft:polished_deepslate_stairs": 720,
  "minecraft:polished_deepslate_wall": 721,
  "minecraft:polished_diorite": 722,
  "minecraft:polished_diorite_slab": 723,
  "minecraft:polished_diorite_stairs": 724,
  "minecraft:polished_granite": 725,
  "minecraft:polished_granite_slab": 726,
  "minecraft:polished_granite_stairs": 727,
  "minecraft:polished_tuff": 728,
  "minecraft:polished_tuff_slab": 729,
  "minecraft:polished_tuff_stairs": 730,
  "minecraft:polished_tuff_wall": 731,
  "minecraft:poppy": 732,
  "minecraft:potatoes": 733,
  "minecraft:potted_acacia_sapling": 734,
  "minecraft:potted_allium": 735,
  "minecraft:potted_azalea_bush": 736,
  "minecraft:potted_azure_bluet": 737,
  "minecraft:potted_bamboo": 738,
  "minecraft:potted_birch_sapling": 739,
  "minecraft:potted_blue_orchid": 740,
  "minecraft:potted_brown_mushroom": 741,
  "minecraft:potted_cactus": 742,
  "minecraft:potted_cherry_sapling": 743,
  "minecraft:potted_closed_eyeblossom": 744,
  "minecraft:potted_cornflower": 745,
  "minecraft:potted_crimson_fungus": 746,
  "minecraft:potted_crimson_roots": 747,
  "minecraft:potted_dandelion": 748,
  "minecraft:potted_dark_oak_sapling": 749,
  "minecraft:potted_dead_bush": 750,
  "minecraft:potted_fern": 751,
  "minecraft:potted_flowering_azalea_bush": 752,
  "minecraft:potted_jungle_sapling": 753,
  "minecraft:potted_lily_of_the_valley": 754,
  "minecraft:potted_mangrove_propagule": 755,
  "minecraft:potted_oak_sapling": 756,
  "minecraft:potted_open_eyeblossom": 757,
  "minecraft:potted_orange_tulip": 758,
  "minecraft:potted_oxeye_daisy": 759,
  "minecraft:potted_pale_oak_sapling": 760,
  "minecraft:potted_pink_tulip": 761,
  "minecraft:potted_poppy": 762,
  "minecraft:potted_red_mushroom": 763,
  "minecraft:potted_red_tulip": 764,
  "minecraft:potted_spruce_sapling": 765,
  "minecraft:potted_torchflower": 766,
  "minecraft:potted_warped_fungus": 767,
  "minecraft:potted_warped_roots": 768,
  "minecraft:potted_white_tulip": 769,
  "minecraft:potted_wither_rose": 770,
  "minecraft:powder_snow": 771,
  "minecraft:powder_snow_cauldron": 772,
  "minecraft:powered_rail": 773,
  "minecraft:prismarine": 774,
  "minecraft:prismarine_brick_slab": 775,
  "minecraft:prismarine_brick_stairs": 776,
  "minecraft:prismarine_bricks": 777,
  "minecraft:prismarine_slab": 778,
  "minecraft:prismarine_stairs": 779,
  "minecraft:prismarine_wall": 780,
  "minecraft:pumpkin": 781,
  "minecraft:pumpkin_stem": 782,
  "minecraft:purple_banner": 783,
  "minecraft:purple_bed": 784,
  "minecraft:purple_candle": 785,
  "minecraft:purple_candle_cake": 786,
  "minecraft:purple_carpet": 787,
  "minecraft:purple_concrete": 788,
  "minecraft:purple_concrete_powder": 789,
  "minecraft:purple_glazed_terracotta": 790,
  "minecraft:purple_shulker_box": 791,
  "minecraft:purple_stained_glass": 792,
  "minecraft:purple_stained_glass_pane": 793,
  "minecraft:purple_terracotta": 794,
  "minecraft:purple_wall_banner": 795,
  "minecraft:purple_wool": 796,
  "minecraft:purpur_block": 797,
  "minecraft:purpur_pillar": 798,
  "minecraft:purpur_slab": 799,
  "minecraft:purpur_stairs": 800,
  "minecraft:quartz_block": 801,
  "minecraft:quartz_bricks": 802,
  "minecraft:quartz_pillar": 803,
  "minecraft:quartz_slab": 804,
  "minecraft:quartz_stairs": 805,
  "minecraft:rail": 806,
  "minecraft:raw_copper_block": 807,
  "minecraft:raw_gold_block": 808,
  "minecraft:raw_iron_block": 809,
  "minecraft:red_banner": 810,
  "minecraft:red_bed": 811,
  "minecraft:red_candle": 812,
  "minecraft:red_candle_cake": 813,
  "minecraft:red_carpet": 814,
  "minecraft:red_concrete": 815,
  "minecraft:red_concrete_powder": 816,
  "minecraft:red_glazed_terracotta": 817,
  "minecraft:red_mushroom": 818,
  "minecraft:red_mushroom_block": 819,
  "minecraft:red_nether_brick_slab": 820,
  "minecraft:red_nether_brick_stairs": 821,
  "minecraft:red_nether_brick_wall": 822,
  "minecraft:red_nether_bricks": 823,
  "minecraft:red_sand": 824,
  "minecraft:red_sandstone": 825,
  "minecraft:red_sandstone_slab": 826,
  "minecraft:red_sandstone_stairs": 827,
  "minecraft:red_sandstone_wall": 828,
  "minecraft:red_shulker_box": 829,
  "minecraft:red_stained_glass": 830,
  "minecraft:red_stained_glass_pane": 831,
  "minecraft:red_terracotta": 832,
  "minecraft:red_tulip": 833,
  "minecraft:red_wall_banner": 834,
  "minecraft:red_wool": 835,
  "minecraft:redstone_block": 836,
  "minecraft:redstone_lamp": 837,
  "minecraft:redstone_ore": 838,
  "minecraft:redstone_torch": 839,
  "minecraft:redstone_wall_torch": 840,
  "minecraft:redstone_wire": 841,
  "minecraft:reinforced_deepslate": 842,
  "minecraft:repeater": 843,
  "minecraft:repeating_command_block": 844,
  "minecraft:resin_block": 845,
  "minecraft:resin_brick_slab": 846,
  "minecraft:resin_brick_stairs": 847,
  "minecraft:resin_brick_wall": 848,
  "minecraft:resin_bricks": 849,
  "minecraft:resin_clump": 850,
  "minecraft:respawn_anchor": 851,
  "minecraft:rooted_dirt": 852,
  "minecraft:rose_bush": 853,
  "minecraft:sand": 854,
  "minecraft:sandstone": 855,
  "minecraft:sandstone_slab": 856,
  "minecraft:sandstone_stairs": 857,
  "minecraft:sandstone_wall": 858,
  "minecraft:scaffolding": 859,
  "minecraft:sculk": 860,
  "minecraft:sculk_catalyst": 861,
  "minecraft:sculk_sensor": 862,
  "minecraft:sculk_shrieker": 863,
  "minecraft:sculk_vein": 864,
  "minecraft:sea_lantern": 865,
  "minecraft:sea_pickle": 866,
  "minecraft:seagrass": 867,
  "minecraft:short_dry_grass": 868,
  "minecraft:short_grass": 869,
  "minecraft:shroomlight": 870,
  "minecraft:shulker_box": 871,
  "minecraft:skeleton_skull": 872,
  "minecraft:skeleton_wall_skull": 873,
  "minecraft:slime_block": 874,
  "minecraft:small_amethyst_bud": 875,
  "minecraft:small_dripleaf": 876,
  "minecraft:smithing_table": 877,
  "minecraft:smoker": 878,
  "minecraft:smooth_basalt": 879,
  "minecraft:smooth_quartz": 880,
  "minecraft:smooth_quartz_slab": 881,
  "minecraft:smooth_quartz_stairs": 882,
  "minecraft:smooth_red_sandstone": 883,
  "minecraft:smooth_red_sandstone_slab": 884,
  "minecraft:smooth_red_sandstone_stairs": 885,
  "minecraft:smooth_sandstone": 886,
  "minecraft:smooth_sandstone_slab": 887,
  "minecraft:smooth_sandstone_stairs": 888,
  "minecraft:smooth_stone": 889,
  "minecraft:smooth_stone_slab": 890,
  "minecraft:sniffer_egg": 891,
  "minecraft:snow": 892,
  "minecraft:snow_block": 893,
  "minecraft:soul_campfire": 894,
  "minecraft:soul_fire": 895,
  "minecraft:soul_lantern": 896,
  "minecraft:soul_sand": 897,
  "minecraft:soul_soil": 898,
  "minecraft:soul_torch": 899,
  "minecraft:soul_wall_torch": 900,
  "minecraft:spawner": 901,
  "minecraft:sponge": 902,
  "minecraft:spore_blossom": 903,
  "minecraft:spruce_button": 904,
  "minecraft:spruce_door": 905,
  "minecraft:spruce_fence": 906,
  "minecraft:spruce_fence_gate": 907,
  "minecraft:spruce_hanging_sign": 908,
  "minecraft:spruce_leaves": 909,
  "minecraft:spruce_log": 910,
  "minecraft:spruce_planks": 911,
  "minecraft:spruce_pressure_plate": 912,
  "minecraft:spruce_sapling": 913,
  "minecraft:spruce_sign": 914,
  "minecraft:spruce_slab": 915,
  "minecraft:spruce_stairs": 916,
  "minecraft:spruce_trapdoor": 917,
  "minecraft:spruce_wall_hanging_sign": 918,
  "minecraft:spruce_wall_sign": 919,
  "minecraft:spruce_wood": 920,
  "minecraft:sticky_piston": 921,
  "minecraft:stone": 922,
  "minecraft:stone_brick_slab": 923,
  "minecraft:stone_brick_stairs": 924,
  "minecraft:stone_brick_wall": 925,
  "minecraft:stone_bricks": 926,
  "minecraft:stone_button": 927,
  "minecraft:stone_pressure_plate": 928,
  "minecraft:stone_slab": 929,
  "minecraft:stone_stairs": 930,
  "minecraft:stonecutter": 931,
  "minecraft:stripped_acacia_log": 932,
  "minecraft:stripped_acacia_wood": 933,
  "minecraft:stripped_bamboo_block": 934,
  "minecraft:stripped_birch_log": 935,
  "minecraft:stripped_birch_wood": 936,
  "minecraft:stripped_cherry_log": 937,
  "minecraft:stripped_cherry_wood": 938,
  "minecraft:stripped_crimson_hyphae": 939,
  "minecraft:stripped_crimson_stem": 940,
  "minecraft:stripped_dark_oak_log": 941,
  "minecraft:stripped_dark_oak_wood": 942,
  "minecraft:stripped_jungle_log": 943,
  "minecraft:stripped_jungle_wood": 944,
  "minecraft:stripped_mangrove_log": 945,
  "minecraft:stripped_mangrove_wood": 946,
  "minecraft:stripped_oak_log": 947,
  "minecraft:stripped_oak_wood": 948,
  "minecraft:stripped_pale_oak_log": 949,
  "minecraft:stripped_pale_oak_wood": 950,
  "minecraft:stripped_spruce_log": 951,
  "minecraft:stripped_spruce_wood": 952,
  "minecraft:stripped_warped_hyphae": 953,
  "minecraft:stripped_warped_stem": 954,
  "minecraft:structure_block": 955,
  "minecraft:structure_void": 956,
  "minecraft:sugar_cane": 957,
  "minecraft:sunflower": 958,
  "minecraft:suspicious_gravel": 959,
  "minecraft:suspicious_sand": 960,
  "minecraft:sweet_berry_bush": 961,
  "minecraft:tall_dry_grass": 962,
  "minecraft:tall_grass": 963,
  "minecraft:tall_seagrass": 964,
  "minecraft:target": 965,
  "minecraft:terracotta": 966,
  "minecraft:test_block": 967,
  "minecraft:test_instance_block": 968,
  "minecraft:tinted_glass": 969,
  "minecraft:tnt": 970,
  "minecraft:torch": 971,
  "minecraft:torchflower": 972,
  "minecraft:torchflower_crop": 973,
  "minecraft:trapped_chest": 974,
  "minecraft:trial_spawner": 975,
  "minecraft:tripwire": 976,
  "minecraft:tripwire_hook": 977,
  "minecraft:tube_coral": 978,
  "minecraft:tube_coral_block": 979,
  "minecraft:tube_coral_fan": 980,
  "minecraft:tube_coral_wall_fan": 981,
  "minecraft:tuff": 982,
  "minecraft:tuff_brick_slab": 983,
  "minecraft:tuff_brick_stairs": 984,
  "minecraft:tuff_brick_wall": 985,
  "minecraft:tuff_bricks": 986,
  "minecraft:tuff_slab": 987,
  "minecraft:tuff_stairs": 988,
  "minecraft:tuff_wall": 989,
  "minecraft:turtle_egg": 990,
  "minecraft:twisting_vines": 991,
  "minecraft:twisting_vines_plant": 992,
  "minecraft:vault": 993,
  "minecraft:verdant_froglight": 994,
  "minecraft:vine": 995,
  "minecraft:wall_torch": 996,
  "minecraft:warped_button": 997,
  "minecraft:warped_door": 998,
  "minecraft:warped_fence": 999,
  "minecraft:warped_fence_gate": 1000,
  "minecraft:warped_fungus": 1001,
  "minecraft:warped_hanging_sign": 1002,
  "minecraft:warped_hyphae": 1003,
  "minecraft:warped_nylium": 1004,
  "minecraft:warped_planks": 1005,
  "minecraft:warped_pressure_plate": 1006,
  "minecraft:warped_roots": 1007,
  "minecraft:warped_sign": 1008,
  "minecraft:warped_slab": 1009,
  "minecraft:warped_stairs": 1010,
  "minecraft:warped_stem": 1011,
  "minecraft:warped_trapdoor": 1012,
  "minecraft:warped_wall_hanging_sign": 1013,
  "minecraft:warped_wall_sign": 1014,
  "minecraft:warped_wart_block": 1015,
  "minecraft:water": 1016,
  "minecraft:water_cauldron": 1017,
  "minecraft:waxed_chiseled_copper": 1018,
  "minecraft:waxed_copper_block": 1019,
  "minecraft:waxed_copper_bulb": 1020,
  "minecraft:waxed_copper_door": 1021,
  "minecraft:waxed_copper_grate": 1022,
  "minecraft:waxed_copper_trapdoor": 1023,
  "minecraft:waxed_cut_copper": 1024,
  "minecraft:waxed_cut_copper_slab": 1025,
  "minecraft:waxed_cut_copper_stairs": 1026,
  "minecraft:waxed_exposed_chiseled_copper": 1027,
  "minecraft:waxed_exposed_copper": 1028,
  "minecraft:waxed_exposed_copper_bulb": 1029,
  "minecraft:waxed_exposed_copper_door": 1030,
  "minecraft:waxed_exposed_copper_grate": 1031,
  "minecraft:waxed_exposed_copper_trapdoor": 1032,
  "minecraft:waxed_exposed_cut_copper": 1033,
  "minecraft:waxed_exposed_cut_copper_slab": 1034,
  "minecraft:waxed_exposed_cut_copper_stairs": 1035,
  "minecraft:waxed_oxidized_chiseled_copper": 1036,
  "minecraft:waxed_oxidized_copper": 1037,
  "minecraft:waxed_oxidized_copper_bulb": 1038,
  "minecraft:waxed_oxidized_copper_door": 1039,
  "minecraft:waxed_oxidized_copper_grate": 1040,
  "minecraft:waxed_oxidized_copper_trapdoor": 1041,
  "minecraft:waxed_oxidized_cut_copper": 1042,
  "minecraft:waxed_oxidized_cut_copper_slab": 1043,
  "minecraft:waxed_oxidized_cut_copper_stairs": 1044,
  "minecraft:waxed_weathered_chiseled_copper": 1045,
  "minecraft:waxed_weathered_copper": 1046,
  "minecraft:waxed_weathered_copper_bulb": 1047,
  "minecraft:waxed_weathered_copper_door": 1048,
  "minecraft:waxed_weathered_copper_grate": 1049,
  "minecraft:waxed_weathered_copper_trapdoor": 1050,
  "minecraft:waxed_weathered_cut_copper": 1051,
  "minecraft:waxed_weathered_cut_copper_slab": 1052,
  "minecraft:waxed_weathered_cut_copper_stairs": 1053,
  "minecraft:weathered_chiseled_copper": 1054,
  "minecraft:weathered_copper": 1055,
  "minecraft:weathered_copper_bulb": 1056,
  "minecraft:weathered_copper_door": 1057,
  "minecraft:weathered_copper_grate": 1058,
  "minecraft:weathered_copper_trapdoor": 1059,
  "minecraft:weathered_cut_copper": 1060,
  "minecraft:weathered_cut_copper_slab": 1061,
  "minecraft:weathered_cut_copper_stairs": 1062,
  "minecraft:weeping_vines": 1063,
  "minecraft:weeping_vines_plant": 1064,
  "minecraft:wet_sponge": 1065,
  "minecraft:wheat": 1066,
  "minecraft:white_banner": 1067,
  "minecraft:white_bed": 1068,
  "minecraft:white_candle": 1069,
  "minecraft:white_candle_cake": 1070,
  "minecraft:white_carpet": 1071,
  "minecraft:white_concrete": 1072,
  "minecraft:white_concrete_powder": 1073,
  "minecraft:white_glazed_terracotta": 1074,
  "minecraft:white_shulker_box": 1075,
  "minecraft:white_stained_glass": 1076,
  "minecraft:white_stained_glass_pane": 1077,
  "minecraft:white_terracotta": 1078,
  "minecraft:white_tulip": 1079,
  "minecraft:white_wall_banner": 1080,
  "minecraft:white_wool": 1081,
  "minecraft:wildflowers": 1082,
  "minecraft:wither_rose": 1083,
  "minecraft:wither_skeleton_skull": 1084,
  "minecraft:wither_skeleton_wall_skull": 1085,
  "minecraft:yellow_banner": 1086,
  "minecraft:yellow_bed": 1087,
  "minecraft:yellow_candle": 1088,
  "minecraft:yellow_candle_cake": 1089,
  "minecraft:yellow_carpet": 1090,
  "minecraft:yellow_concrete": 1091,
  "minecraft:yellow_concrete_powder": 1092,
  "minecraft:yellow_glazed_terracotta": 1093,
  "minecraft:yellow_shulker_box": 1094,
  "minecraft:yellow_stained_glass": 1095,
  "minecraft:yellow_stained_glass_pane": 1096,
  "minecraft:yellow_terracotta": 1097,
  "minecraft:yellow_wall_banner": 1098,
  "minecraft:yellow_wool": 1099,
  "minecraft:zombie_head": 1100,
  "minecraft:zombie_wall_head": 1101
}